In [1]:
from utils.schedule_utils import load_data_split,table_to_str,table_to_str_sql,find_intersection_and_add_row_id,Prepare_Data_for_Operator_Sequence,format_document,batch_rerank_scores,ROLLBACK,merge_clean_and_format_df_dict,retrieve_rows_by_subtables,process_error_analysis_list
import pickle
import numpy as np
import pandas as pd
import os
import json
from FlagEmbedding import FlagReranker
from tqdm import tqdm
from typing import Dict, Any
from utils.evaluator import Evaluator
from utils.prompt_generate import build_wikitq_prompt_from_df,evaluate_predictions,filter_dataframe_from_responses,fix_sql_query,match_subtables,retrieve_rows_by_subtables,build_tab_fact_prompt_from_df
from utils.async_llm import infer_prompts

/home/aizoo/miniconda3/envs/hstar/lib/python3.9/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]

In [ ]:
## wikitq: 0.491 second/query 
## tab_fact: 0.29 second/query

In [2]:
from vllm import LLM, SamplingParams
from transformers import AutoTokenizer
import pandas as pd
import numpy as np
from time import sleep
import argparse
from vllm.lora.request import LoRARequest
import json
from tqdm import tqdm
import os

INFO 10-26 23:14:51 [__init__.py:216] Automatically detected platform cuda.

In [22]:
llm_path = '/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507'
# llm_path = '/data/workspace/yanmy/models/Qwen2.5-7B-Instruct/'
llm = LLM(model=llm_path,
        tensor_parallel_size=2,
        enforce_eager=True,
        enable_chunked_prefill=True,
        max_model_len=23000,
        # num_scheduler_steps=10,
        enable_prefix_caching=True,
        gpu_memory_utilization = 0.85,
        )

tokenizer = AutoTokenizer.from_pretrained(llm_path)

INFO 10-17 23:27:02 [utils.py:233] non-default args: {'max_model_len': 23000, 'tensor_parallel_size': 2, 'enable_prefix_caching': True, 'gpu_memory_utilization': 0.85, 'disable_log_stats': True, 'enforce_eager': True, 'enable_chunked_prefill': True, 'model': '/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507'}
INFO 10-17 23:27:02 [model.py:547] Resolved architecture: Qwen3ForCausalLM

`torch_dtype` is deprecated! Use `dtype` instead!

INFO 10-17 23:27:02 [model.py:1510] Using max model len 23000
INFO 10-17 23:27:02 [scheduler.py:205] Chunked prefill is enabled with max_num_batched_tokens=8192.
INFO 10-17 23:27:02 [__init__.py:381] Cudagraph is disabled under eager mode
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:03 [core.py:644] Waiting for init message from front-end.
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:03 [core.py:77] Initializing a V1 LLM engine (v0.11.0) with config: model='/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507', speculative_config=None, tokenizer='/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507', skip_tokenizer_init=False, tokenizer_mode=auto, revision=None, tokenizer_revision=None, trust_remote_code=False, dtype=torch.bfloat16, max_seq_len=23000, download_dir=None, load_format=auto, tensor_parallel_size=2, pipeline_parallel_size=1, data_parallel_size=1, disable_custom_all_reduce=False, quantization=None, enforce_eager=True, kv_cache_dtype=auto, device_config=cuda, structured_outputs_config=StructuredOutputsConfig(backend='auto', disable_fallback=False, disable_any_whitespace=False, disable_additional_properties=False, reasoning_parser=''), observability_config=ObservabilityConfig(show_hidden_metrics_for_version=None, otlp_traces_endpoint=None, collect_detailed_traces=None), seed=0, served_model_name=/data/workspace/yanmy/models/Qwen3-4B-Instruct-2507, enable_prefix_caching=True, chunked_prefill_enabled=True, pooler_config=None, compilation_config={"level":0,"debug_dump_path":"","cache_dir":"","backend":"","custom_ops":[],"splitting_ops":null,"use_inductor":true,"compile_sizes":[],"inductor_compile_config":{"enable_auto_functionalized_v2":false},"inductor_passes":{},"cudagraph_mode":0,"use_cudagraph":true,"cudagraph_num_of_warmups":0,"cudagraph_capture_sizes":[],"cudagraph_copy_inputs":false,"full_cuda_graph":false,"use_inductor_graph_partition":false,"pass_config":{},"max_capture_size":0,"local_cache_dir":null}
(EngineCore_DP0 pid=1542434) WARNING 10-17 23:27:03 [multiproc_executor.py:720] Reducing Torch parallelism from 32 threads to 1 to avoid unnecessary CPU contention. Set OMP_NUM_THREADS in the external environment to tune this value as needed.
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:03 [shm_broadcast.py:289] vLLM message queue communication handle: Handle(local_reader_ranks=[0, 1], buffer_handle=(2, 16777216, 10, 'psm_972d558e'), local_subscribe_addr='ipc:///tmp/6883b191-5343-490c-b4dd-25d848206dc7', remote_subscribe_addr=None, remote_addr_ipv6=False)
(EngineCore_DP0 pid=1542434) (EngineCore_DP0 pid=1542434) INFO 10-17 23:27:05 [shm_broadcast.py:289] vLLM message queue communication handle: Handle(local_reader_ranks=[0], buffer_handle=(1, 10485760, 10, 'psm_fe6e571d'), local_subscribe_addr='ipc:///tmp/62979abd-2cad-4d69-b41f-312fa6881067', remote_subscribe_addr=None, remote_addr_ipv6=False)
INFO 10-17 23:27:05 [shm_broadcast.py:289] vLLM message queue communication handle: Handle(local_reader_ranks=[0], buffer_handle=(1, 10485760, 10, 'psm_e57a4da6'), local_subscribe_addr='ipc:///tmp/8b44e45a-02dd-403c-a46a-cf21eeb8826e', remote_subscribe_addr=None, remote_addr_ipv6=False)
(EngineCore_DP0 pid=1542434) (EngineCore_DP0 pid=1542434) INFO 10-17 23:27:05 [__init__.py:1384] Found nccl from library libnccl.so.2
INFO 10-17 23:27:05 [__init__.py:1384] Found nccl from library libnccl.so.2
(EngineCore_DP0 pid=1542434) (EngineCore_DP0 pid=1542434) INFO 10-17 23:27:05 [pynccl.py:103] vLLM is using nccl==2.27.3
INFO 10-17 23:27:05 [pynccl.py:103] vLLM is using nccl==2.27.3
(EngineCore_DP0 pid=1542434) (EngineCore_DP0 pid=1542434) WARNING 10-17 23:27:05 [symm_mem.py:58] SymmMemCommunicator: Device capability 8.9 not supported, communicator is not available.
WARNING 10-17 23:27:05 [symm_mem.py:58] SymmMemCommunicator: Device capability 8.9 not supported, communicator is not available.
(EngineCore_DP0 pid=1542434) (EngineCore_DP0 pid=1542434) INFO 10-17 23:27:05 [custom_all_reduce.py:35] Skipping P2P check and trusting the driver's P2P report.
INFO 10-17 23:27:05 [custom_all_reduce.py:35] Skipping P2P check and trusting the driver's P2P report.
(EngineCore_DP0 pid=1542434) (EngineCore_DP0 pid=1542434) WARNING 10-17 23:27:05 [custom_all_reduce.py:154] Custom allreduce is disabled because your platform lacks GPU P2P capability or P2P test failed. To silence this warning, specify disable_custom_all_reduce=True explicitly.
WARNING 10-17 23:27:05 [custom_all_reduce.py:154] Custom allreduce is disabled because your platform lacks GPU P2P capability or P2P test failed. To silence this warning, specify disable_custom_all_reduce=True explicitly.
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:05 [shm_broadcast.py:289] vLLM message queue communication handle: Handle(local_reader_ranks=[1], buffer_handle=(1, 4194304, 6, 'psm_81e3d482'), local_subscribe_addr='ipc:///tmp/fede11c3-edaa-4831-8d30-b3dad22998ca', remote_subscribe_addr=None, remote_addr_ipv6=False)
(EngineCore_DP0 pid=1542434) (EngineCore_DP0 pid=1542434) INFO 10-17 23:27:05 [__init__.py:1384] Found nccl from library libnccl.so.2
INFO 10-17 23:27:05 [__init__.py:1384] Found nccl from library libnccl.so.2
(EngineCore_DP0 pid=1542434) (EngineCore_DP0 pid=1542434) INFO 10-17 23:27:05 [pynccl.py:103] vLLM is using nccl==2.27.3
INFO 10-17 23:27:05 [pynccl.py:103] vLLM is using nccl==2.27.3
[Gloo] Rank [Gloo] Rank 1 is connected to 01 is connected to  peer ranks. 1Expected number of connected peer ranks is :  peer ranks. 1Expected number of connected peer ranks is : 1

[Gloo] Rank [Gloo] Rank 1 is connected to 01 is connected to  peer ranks. 1Expected number of connected peer ranks is :  peer ranks. 1Expected number of connected peer ranks is : 1

[Gloo] Rank 0 is connected to 0 peer ranks. [Gloo] Rank Expected number of connected peer ranks is : 0
0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 0 peer ranks. Expected number of connected peer ranks is : 0
[Gloo] Rank 0 is connected to 1 peer ranks. Expected number of connected peer ranks is : [Gloo] Rank 11
 is connected to 1 peer ranks. Expected number of connected peer ranks is : 1
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:05 [parallel_state.py:1208] rank 1 in world size 2 is assigned as DP rank 0, PP rank 0, TP rank 1, EP rank 1
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:05 [parallel_state.py:1208] rank 0 in world size 2 is assigned as DP rank 0, PP rank 0, TP rank 0, EP rank 0
(EngineCore_DP0 pid=1542434) WARNING 10-17 23:27:06 [topk_topp_sampler.py:66] FlashInfer is not available. Falling back to the PyTorch-native implementation of top-p & top-k sampling. For the best performance, please install FlashInfer.
(EngineCore_DP0 pid=1542434) WARNING 10-17 23:27:06 [topk_topp_sampler.py:66] FlashInfer is not available. Falling back to the PyTorch-native implementation of top-p & top-k sampling. For the best performance, please install FlashInfer.
(EngineCore_DP0 pid=1542434) (Worker_TP0 pid=1542456) (EngineCore_DP0 pid=1542434) (Worker_TP1 pid=1542458) INFO 10-17 23:27:06 [gpu_model_runner.py:2602] Starting to load model /data/workspace/yanmy/models/Qwen3-4B-Instruct-2507...
INFO 10-17 23:27:06 [gpu_model_runner.py:2602] Starting to load model /data/workspace/yanmy/models/Qwen3-4B-Instruct-2507...
(EngineCore_DP0 pid=1542434) (Worker_TP1 pid=1542458) INFO 10-17 23:27:06 [gpu_model_runner.py:2634] Loading model from scratch...
(EngineCore_DP0 pid=1542434) (Worker_TP0 pid=1542456) INFO 10-17 23:27:07 [gpu_model_runner.py:2634] Loading model from scratch...
(EngineCore_DP0 pid=1542434) (Worker_TP1 pid=1542458) INFO 10-17 23:27:07 [cuda.py:366] Using Flash Attention backend on V1 engine.
(EngineCore_DP0 pid=1542434) (Worker_TP0 pid=1542456) INFO 10-17 23:27:07 [cuda.py:366] Using Flash Attention backend on V1 engine.

Loading safetensors checkpoint shards:   0% Completed | 0/3 [00:00<?, ?it/s]

(EngineCore_DP0 pid=1542434) (Worker_TP1 pid=1542458) INFO 10-17 23:27:07 [default_loader.py:267] Loading weights took 0.87 seconds
(EngineCore_DP0 pid=1542434) (Worker_TP0 pid=1542456) INFO 10-17 23:27:08 [default_loader.py:267] Loading weights took 0.87 seconds
(EngineCore_DP0 pid=1542434) (Worker_TP0 pid=1542456) INFO 10-17 23:27:08 [gpu_model_runner.py:2653] Model loading took 3.8657 GiB and 0.997680 seconds
(EngineCore_DP0 pid=1542434) (Worker_TP1 pid=1542458) INFO 10-17 23:27:09 [gpu_model_runner.py:2653] Model loading took 3.8657 GiB and 0.996497 seconds
(EngineCore_DP0 pid=1542434) (Worker_TP0 pid=1542456) INFO 10-17 23:27:13 [gpu_worker.py:298] Available KV cache memory: 14.64 GiB
(EngineCore_DP0 pid=1542434) (Worker_TP1 pid=1542458) INFO 10-17 23:27:13 [gpu_worker.py:298] Available KV cache memory: 14.64 GiB
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:13 [kv_cache_utils.py:1087] GPU KV cache size: 213,248 tokens
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:13 [kv_cache_utils.py:1091] Maximum concurrency for 23,000 tokens per request: 9.27x
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:13 [kv_cache_utils.py:1087] GPU KV cache size: 213,248 tokens
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:13 [kv_cache_utils.py:1091] Maximum concurrency for 23,000 tokens per request: 9.27x
(EngineCore_DP0 pid=1542434) (EngineCore_DP0 pid=1542434) (Worker_TP1 pid=1542458) (Worker_TP0 pid=1542456) WARNING 10-17 23:27:13 [cudagraph_dispatcher.py:106] cudagraph dispatching keys are not initialized. No cudagraph will be used.
WARNING 10-17 23:27:13 [cudagraph_dispatcher.py:106] cudagraph dispatching keys are not initialized. No cudagraph will be used.
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:13 [core.py:210] init engine (profile, create kv cache, warmup model) took 4.80 seconds
(EngineCore_DP0 pid=1542434) INFO 10-17 23:27:14 [__init__.py:381] Cudagraph is disabled under eager mode
INFO 10-17 23:27:14 [llm.py:306] Supported_tasks: ['generate']

In [23]:
def response_vllm(llm,all_instructions,sample_num: int):
    text_all = []
    # all_instructions = prompts_list
    for prompt in tqdm(all_instructions, desc="Formatting Prompts"):
        messages = [{"role": "user", "content": prompt}]
        text = tokenizer.apply_chat_template(
            messages,
            tokenize=False,
            add_generation_prompt=True
        )
        text_all.append(text)
    if sample_num == 1:
        sampling_params = SamplingParams(temperature=0, top_p=1, max_tokens=2048) 
    else:
        ## top_k/min_p 传不进去
        sampling_params = SamplingParams(n=sample_num, temperature=0.7, top_p=0.8, top_k=20, min_p=0, max_tokens=2048) 
    outputs = llm.generate(text_all, sampling_params)
    generation_list = []
    for output in tqdm(outputs, desc="Processing Outputs"):
        generated_text = [o.text for o in output.outputs]
        generation_list.append(generated_text)
    return generation_list

In [3]:
## 参数记录 for wikitq
N_PARALLEL = 32 ## only for convert_df_type_parallel.py of data preprocess，一次性离线的
embedding_base_model_path = '/data/workspace/yanmy/models/bge-m3'
router_model_path = '/data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-finetuned/' ## fine-tuned router model path
check_moedl_path = '/data/workspace/yanmy/HybridRAG/H-STAR/check/output/bge-reranker-v2-m3-finetuned/' ## check model path
tmp_save_path = 'datasets/schedule_test/fetaqa' ## 临时存储路径
dataset_name = 'fetaqa'
split = 'test'
tau = 0.82
check_tau = 0.8
ALL_LABELS = [
    'Base', 'Select_Row', 'Select_Column', 'Execute_SQL', 'RAG_20_5', 
]

### Pipeline 的过程分为以下调度步骤
- 所有调度需要的文件均放在了 `schedule_test/datasets/wikitq`与`schedule_test/datasets/tab_fact`文件夹里面
1. （独立的）跑下面的指令：`python convert_df_type_parallel.py --dataset_name tab_fact --split test_small --output_path datasets/schedule_test/tab_fact/wikitq_df_processed.npy --num_workers 32`
2. (独立的)读取 `datasets/schedule_test/tab_fact/wikitq_df_processed.npy`,构造 inference_router 的文件，输出到`datasets/schedule_test/tab_fact/router_query.pkl`
3. (独立的)构造 DB
4. (GPU-21GB) inference router model，输出route result 到 `datasets/schedule_test/tab_fact/inference_result.pkl` 通过命令：`python inference_router.py --input_path datasets/schedule_test/tab_fact/router_query.pkl --model_path /data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-router-tab_fact-hn --output_path datasets/schedule_test/tab_fact/inference_result.pkl`
5. (CPU) 解析 router 结果，生成初步的路径并开始任务调度(重排)
6. (GPU-1.8G) 根据 `datasets/schedule_test/tab_fact/RAG_index.npy`，执行 RAG 任务，根据下面的指令
7. (GPU-vLLM) LLM 根据初步路径，对`Select_Row`, `Select_Column`, `Execute_SQL`执行中间命令
8. (CPU) 根据中间结果，link db 做sql command parse，执行 sql,返回 subtable_list
9. (GPU-1.8G) 加载并运行 Check Model，跑 3 次（FORWARD 机制）
10. (GPU-vLLM) add execute SQL
11. (GPU-vLLM) generate qa command, inference vLLM, evaluate

In [4]:
## step:1
f'python convert_df_type_parallel.py --dataset_name {dataset_name} --split {split} --output_path {tmp_save_path}/wikitq_df_processed.npy --num_workers {N_PARALLEL}'

'python convert_df_type_parallel.py --dataset_name fetaqa --split test --output_path datasets/schedule_test/fetaqa/wikitq_df_processed.npy --num_workers 32'

In [12]:
## step 4: inference router model
f'python inference_router.py --input_path {tmp_save_path}/router_query.pkl --model_path {router_model_path} --output_path {tmp_save_path}/inference_result.pkl'

'python inference_router.py --input_path datasets/schedule_test/fetaqa/router_query.pkl --model_path /data/workspace/yanmy/HybridRAG/H-STAR/router/bge-m3-finetuned/ --output_path datasets/schedule_test/fetaqa/inference_result.pkl'

In [19]:
## step 6: RAG
f'python Hybrid_Retrieve.py --model_path {embedding_base_model_path} --dataset_name {dataset_name} --split {split} --index_path {tmp_save_path}/RAG_index.npy --output_path {tmp_save_path}/Hybrid_Retrieve_output.npy --max_rows 20 --max_cols 5 --processed_df_path {tmp_save_path}/wikitq_df_processed.npy'

'python Hybrid_Retrieve.py --model_path /data/workspace/yanmy/models/bge-m3 --dataset_name fetaqa --split test --index_path datasets/schedule_test/fetaqa/RAG_index.npy --output_path datasets/schedule_test/fetaqa/Hybrid_Retrieve_output.npy --max_rows 20 --max_cols 5 --processed_df_path datasets/schedule_test/fetaqa/wikitq_df_processed.npy'

In [9]:
### 读取必要文件（step 2）
dataset = load_data_split(dataset_name,split)
wikitq_df_processed = np.load(f'{tmp_save_path}/wikitq_df_processed.npy',allow_pickle=True).item()

In [10]:
## step 2: 构建semantic router的输入文件，并输出
semantic_router = {}
# semantic_router[
for index in range(len(dataset)):
    semantic_router[index] = {}
    semantic_router[index]['query'] = dataset[index]['question']
    semantic_router[index]['title'] = dataset[index]['table']['page_title']
    semantic_router[index]['table'] = wikitq_df_processed[index]
    label_list = []
    semantic_router[index]['label'] = label_list
with open(f'{tmp_save_path}/router_query.pkl','wb') as f:
    pickle.dump(semantic_router,f)

In [11]:
## step 3: Consturct DB
from utils.multi_db_v2 import NeuralDB, Executor
table_titles = [dataset[i]['table']['page_title'] for i in range(len(dataset))]
db = NeuralDB(tables=wikitq_df_processed, table_titles=table_titles)
executor = Executor()

Initializing NeuralDB...

Creating tables in DB:   0%|          | 0/2003 [00:00<?, ?it/s]

In [14]:
## step 5
with open(f'{tmp_save_path}/inference_result.pkl', 'rb') as f:
    error_analysis_row = pickle.load(f)
# with open(f'../router/inference_results.pkl', 'rb') as f:
#     error_analysis_row = pickle.load(f)
ranked_result = process_error_analysis_list(error_analysis_row, truncate=True, tau=0.82)
pd.DataFrame([str(r) for r in ranked_result.values()]).value_counts()

0
['Execute_SQL']                                   1584
['Base']                                           130
['Select_Row', 'Select_Column', 'Execute_SQL']     125
['Select_Column', 'Select_Row', 'Execute_SQL']      62
['Select_Row', 'Execute_SQL']                       43
['RAG_20_5']                                        16
['Select_Row']                                      14
['RAG_20_5', 'Select_Row', 'Execute_SQL']            7
['Select_Column', 'Execute_SQL']                     6
['Select_Row', 'RAG_20_5', 'Execute_SQL']            5
['RAG_20_5', 'Execute_SQL']                          4
['Select_Column']                                    3
['Select_Column', 'RAG_20_5', 'Execute_SQL']         3
['RAG_20_5', 'Select_Column', 'Execute_SQL']         1
Name: count, dtype: int64

In [17]:
## step 5
## Organize LLM query list
LLM_query_list = {}
for method in ALL_LABELS:
    LLM_query_list[method] = {}
    LLM_query_list[method]['index'] = []
    LLM_query_list[method]['query'] = []
    LLM_query_list[method]['qa'] = []
for index in range(len(dataset)):
    for method in ALL_LABELS:
        if method in ranked_result[index]:
            # method_list = ranked_result[index][method]
            # method_list.append(index)
            LLM_query_list[method]['index'].extend([index])
            if method=='Select_Column':
                prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/col_select_sql.txt',processed=True)
                LLM_query_list[method]['query'].extend([prompt])
            elif method=='Select_Row':
                prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/row_select_sql.txt',processed=True)
                LLM_query_list[method]['query'].extend([prompt])
            elif method == 'Execute_SQL':
                prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/sql_reason_fetaqa.txt',processed=True)
                LLM_query_list[method]['query'].extend([prompt])
            # elif method == 'Base':
            #     prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/text_reason_tabfact.txt',processed=True)
            #     LLM_query_list[method]['qa'].extend([prompt])

In [18]:
## step 5 暂存 RAG 的 list，输出到路径
np.save(f'{tmp_save_path}/RAG_index.npy',LLM_query_list['RAG_20_5']['index'])

- 执行`Hybrid_Retrieve.py` 任务

In [20]:
## load Hybrid_Retrieve 的结果
RAG_20_5 = np.load(f'{tmp_save_path}/Hybrid_Retrieve_output.npy',allow_pickle=True).item()

In [ ]:
## step 7: api vLLM
### Query LLM with async engine，启动模型采用 sh llm_server.sh，这个是不是可以放在调度的第一个环节，不计入时间

metrics_rows = {}
summary = {}
for method in ['Select_Row','Select_Column']:
    prompt_list = LLM_query_list[method]['query']
    response_list,metrics_rows[method],summary[method] = infer_prompts(prompt_list, temperature=0.7, top_p=0.8, sample_num=2)
    LLM_query_list[method]['response'] = response_list
for method in ['Execute_SQL']:
    prompt_list = LLM_query_list[method]['query']
    response_list,metrics_rows[method],summary[method] = infer_prompts(prompt_list, temperature=0.7, top_p=0.8, sample_num=3)
    LLM_query_list[method]['response'] = response_list

In [21]:
## step 7
### Query LLM with async engine，启动模型采用 sh llm_server.sh，这个是不是可以放在调度的第一个环节，不计入时间

metrics_rows = {}
summary = {}
for method in ['Select_Row','Select_Column']:
    prompt_list = LLM_query_list[method]['query']
    response_list = response_vllm(llm,prompt_list, sample_num=2)
    LLM_query_list[method]['response'] = response_list
for method in ['Execute_SQL']:
    prompt_list = LLM_query_list[method]['query']
    response_list = response_vllm(llm,prompt_list, sample_num=3)
    LLM_query_list[method]['response'] = response_list

NameError: name 'response_vllm' is not defined

In [25]:
## step: 7 offline Batch
all_list = []
index_list = {}
index_count = 0
for method in ['Select_Row','Select_Column']:
    prompt_list = LLM_query_list[method]['query']
    all_list.extend(prompt_list)
    index_count += len(prompt_list)
    index_list[method] = index_count
    # response_list = response_vllm(prompt_list, sample_num=2)
    # LLM_query_list[method]['response'] = response_list
for method in ['Execute_SQL']:
    prompt_list = LLM_query_list[method]['query']
    all_list.extend(prompt_list)
    index_count += len(prompt_list)
    index_list[method] = index_count
    # response_list = response_vllm(prompt_list, sample_num=2)
    # LLM_query_list[method]['response'] = response_list
response_list = response_vllm(llm, all_list, sample_num=3)
# for method in ['Select_Row','Select_Column','Execute_SQL']:
    # response_subset = 
LLM_query_list['Select_Row']['response'] = response_list[0:index_list['Select_Row']]
LLM_query_list['Select_Column']['response'] = response_list[index_list['Select_Row']:index_list['Select_Column']]
LLM_query_list['Execute_SQL']['response'] = response_list[index_list['Select_Column']:]

Formatting Prompts:   0%|          | 0/2296 [00:00<?, ?it/s]

Formatting Prompts: 100%|██████████| 2296/2296 [00:00<00:00, 30328.23it/s]

Adding requests:   0%|          | 0/2296 [00:00<?, ?it/s]

Processed prompts:   0%|          | 0/6888 [00:00<?, ?it/s, est. speed input: 0.00 toks/s, output: 0.00 toks/s…

Processing Outputs: 100%|██████████| 2296/2296 [00:00<00:00, 154254.72it/s]

- row_sql

In [28]:
## step 8: SQP parse row

from tqdm.notebook import tqdm
sub_table_list_all = {}
filtered_tables_row = {}
row_sql_index_list = LLM_query_list['Select_Row']['index']
row_sql_response_list = LLM_query_list['Select_Row']['response']
for i in range(len(row_sql_index_list)):
    # sample_num = [0,1]
    sample_num = [0,1,2]
    sub_table_list = []
    for sample_index in sample_num:
        ## 相对距离
        index = row_sql_index_list[i]
        #  = row_sql_response_list[i][sample_index]
        # relevant_index = row_sql_index_list.index(index)
        original_text = row_sql_response_list[i][sample_index]
        sql = fix_sql_query(response_text=original_text,table_df=wikitq_df_processed[index],table_title=table_titles[index])
        try:
            result_1 = executor.sql_exec(sql.replace('``','`').replace("COUNT(*)", "*"), db, table_id=index)
            sub_table_list.append(pd.DataFrame(result_1['rows'],columns=result_1['header']))
        except:
            continue
    # print(dataset[index]['question'],dataset[index]['answer_text'])
    # match_subtables(large_table=wikitq_df_processed[index], sub_tables=[pd.DataFrame(result_1['rows'],columns=result_1['header'])])
    # pd.DataFrame(result_1['rows'],columns=result_1['header'])
    sub_table_list_all[index] = sub_table_list
    filtered_df = retrieve_rows_by_subtables(wikitq_df_processed[index],sub_table_list)
    if len(filtered_df) == 0:
        filtered_df = wikitq_df_processed[index]
    filtered_tables_row[index] = filtered_df

Executing on table_id 8 ('w8'): SELECT role FROM w WHERE year = '2007';
Executing on table_id 8 ('w8'): SELECT role FROM w WHERE year = '2007';
Executing on table_id 8 ('w8'): SELECT role FROM w WHERE year = '2007';
Executing on table_id 11 ('w11'): SELECT `club performance_2` FROM w WHERE `club performance` LIKE '2002%';
Executing on table_id 11 ('w11'): SELECT `club performance_2` FROM w WHERE `club performance` LIKE '2002%';
Executing on table_id 11 ('w11'): -Decompose:   - Part 1: Find the row where the year is 2002     Response 1: SELECT * FROM w WHERE `club performance` LIKE '2002%';   - Part 2: Get the club name (second column) from that row     Response 2: SELECT `club performance_2` FROM w WHERE `club performance` LIKE '2002%';  -Retrieval:   SQL: SELECT `club performance_2` FROM w WHERE `club performance` LIKE '2002%';
Executing on table_id 16 ('w16'): - Decompose:   - Part 1: Find the second album in chronological order     Response 1: SELECT `album`, `year` FROM w ORDER BY `year` ASC LIMIT 1 OFFSET 1; - Retrieval:   SQL: SELECT `album`, `year` FROM w ORDER BY `year` ASC LIMIT 1 OFFSET 1;
Executing on table_id 16 ('w16'): SELECT `year`, `album` FROM w WHERE `album` = (SELECT `album` FROM w ORDER BY `album` LIMIT 1 OFFSET 1);
Executing on table_id 16 ('w16'): SELECT `album`, `year` FROM w WHERE `album` = (SELECT `album` FROM w ORDER BY `album` LIMIT 1 OFFSET 1);
Executing on table_id 28 ('w28'): SELECT role FROM w WHERE year = 2008;
Executing on table_id 28 ('w28'): SELECT role FROM w WHERE year = 2008;
Executing on table_id 28 ('w28'): SELECT role FROM w WHERE year = 2008;
Executing on table_id 33 ('w33'): SELECT * FROM w WHERE `party` = 'labour' OR `party_2` = 'labour' OR `party` = 'conservative' OR `party_2` = 'conservative';
Executing on table_id 33 ('w33'): SELECT * FROM w WHERE (`party` = 'none' AND `party_2` = 'labour' OR `candidate` LIKE '%labour%') OR (`party` = 'none' AND `party_2` = 'conservative' OR `candidate` LIKE '%conservative%');
Executing on table_id 33 ('w33'): SELECT * FROM w WHERE (`party` = 'none' AND `party_2` = 'labour' OR `candidate` LIKE '%labour%') OR (`party` = 'none' AND `party_2` = 'conservative' OR `candidate` LIKE '%conservative%');
Executing on table_id 37 ('w37'): SELECT `destinations` FROM w WHERE `destinations` IS NOT NULL;
Executing on table_id 37 ('w37'): SELECT `destinations` FROM w WHERE `destinations` IS NOT NULL;
Executing on table_id 37 ('w37'): SELECT `destinations` FROM w WHERE `destinations` IS NOT NULL AND `destinations` != '';
Executing on table_id 51 ('w51'): SELECT * FROM w WHERE `-` = '1987–88' OR `-` = '1985–86';
Executing on table_id 51 ('w51'): SELECT * FROM w WHERE `-` = '1987–88' OR `-` = '1985–86';
Executing on table_id 51 ('w51'): SELECT * FROM w WHERE `-` = '1987–88' OR `-` = '1985–86';
Executing on table_id 54 ('w54'): SELECT * FROM w WHERE `director` = 'steven spielberg';
Executing on table_id 54 ('w54'): SELECT * FROM w WHERE `director` = 'steven spielberg' AND `role` != 'none';
Executing on table_id 54 ('w54'): Decompose:  - Part 1: Find all entries where the director is Steven Spielberg    Response 1: SELECT * FROM w WHERE director = 'steven spielberg';  Retrieval:  SQL: SELECT * FROM w WHERE director = 'steven spielberg';
Executing on table_id 57 ('w57'): SELECT role FROM w WHERE year = 2010;
Executing on table_id 57 ('w57'): SELECT role FROM w WHERE year = 2010;
Executing on table_id 57 ('w57'): SELECT role FROM w WHERE year = 2010;
Executing on table_id 83 ('w83'): SELECT `club`, `division` FROM w WHERE `season` = '1929–30';
Executing on table_id 83 ('w83'): Decompose:   - Part 1: Find the rows where the season is 1929–30     Response 1: SELECT * FROM w WHERE `season` = '1929–30';   - Part 2: Extract the club and division for those rows     Response 2: SELECT `club`, `division` FROM w WHERE `season` = '1929–30';  Retrieval:  SQL: SELECT `club`, `division` FROM w WHERE `season` = '1929–30';
Executing on table_id 83 ('w83'): SELECT `club`, `division` FROM w WHERE `season` = '1929–30';
Executing on table_id 111 ('w111'): SELECT * FROM w WHERE year = 2016 AND event LIKE '%100 metres%';
Executing on table_id 111 ('w111'): SELECT * FROM w WHERE year = 2016 AND event LIKE '100 metres';
Executing on table_id 111 ('w111'): SELECT * FROM w WHERE `event` LIKE '%100 metres%' AND `year` = 2016;
Executing on table_id 118 ('w118'): SELECT `work` FROM w WHERE `result` = 'won' ORDER BY `year` ASC LIMIT 1;
Executing on table_id 118 ('w118'): SELECT `work` FROM w WHERE `result` = 'won' ORDER BY `year` ASC LIMIT 1;
Executing on table_id 118 ('w118'): SELECT `work` FROM w WHERE `result` = 'won' ORDER BY `year` ASC LIMIT 1;
Executing on table_id 122 ('w122'): - Decompose:   - Part 1: Find rows where club is 'boreham wood'   - Part 2: Find rows where season is '2015–16'   - Part 3: Select total appearances and total goals (from total and total_2 columns) - Retrieval:   SQL: SELECT `total`, `total_2` FROM w WHERE `club` = 'boreham wood' AND `season` = '2015–16';
Executing on table_id 122 ('w122'): Decompose:   - Part 1: Find rows where club is 'boreham wood'   - Part 2: Among those, find the row with season '2015–16'   - Part 3: Extract the total goals and total appearances (from 'total' and 'total_2')  Retrieval:  SQL: SELECT `total`, `total_2` FROM w WHERE `club` = 'boreham wood' AND `season` = '2015–16';
Executing on table_id 122 ('w122'): - Decompose:   - Part 1: Find the row where club is 'boreham wood' and season is '2015–16'     Response 1: SELECT * FROM w WHERE `club` = 'boreham wood' AND `season` = '2015–16';  - Retrieval:   SQL: SELECT * FROM w WHERE `club` = 'boreham wood' AND `season` = '2015–16';
Executing on table_id 126 ('w126'): - Decompose:    - Part 1: Find all entries in the year 2018   - Part 2: Among those, find where Hillsburn is nominated (using fuzzy match on 'nominated' field) - Retrieval:    SQL: SELECT `award` FROM w WHERE `year` = 2018 AND `nominated` LIKE '%hillsburn%';
Executing on table_id 126 ('w126'): - Decompose:   - Part 1: Find all entries in the year 2018     Response 1: SELECT * FROM w WHERE year = 2018;   - Part 2: Find entries where Hillsburn is nominated     Response 2: SELECT * FROM w WHERE `nominated` LIKE '%hillsburn%' AND year = 2018;   - Part 3: Extract the award names for such nominations     Response 3: SELECT `award` FROM w WHERE `nominated` LIKE '%hillsburn%' AND year = 2018;  - Retrieval:   SQL: SELECT `award` FROM w WHERE year = 2018 AND `nominated` LIKE '%hillsburn%';
Executing on table_id 126 ('w126'): - Decompose:   - Part 1: Find rows where year is 2018   - Part 2: Find rows where "nominated" contains "hillsburn"   - Part 3: Select the award from those rows  - Retrieval:   SQL: SELECT `award` FROM w WHERE `year` = 2018 AND `nominated` LIKE '%hillsburn%';
Executing on table_id 140 ('w140'): -Decompose:    - Part 1: Find rows where the season is 1999–2000   - Part 2: Extract team name from the '-_2' column for those rows   - Part 3: Extract conference (league) from the '-_3' column for those rows -Retrieval:    SQL: SELECT `-` AS season, `-_2` AS team, `-_3` AS conference FROM w WHERE `-` LIKE '1999–2000';
Executing on table_id 140 ('w140'): Decompose:   - Part 1: Find rows where the season is 1999–2000   - Part 2: Extract the team name for those rows   - Part 3: Extract the conference (league) for those rows  Retrieval:  SQL: SELECT `- _2`, `- _3` FROM w WHERE `-' LIKE '%1999–2000%';
Executing on table_id 140 ('w140'): Decompose:   - Part 1: Find rows where the season is 1999–2000   - Part 2: Extract the team name (from -_2 column)   - Part 3: Extract the league/conference (from -_3 column)  Retrieval:  SQL: SELECT `-2`, `-3` FROM w WHERE `-' LIKE '%1999–2000%';
Executing on table_id 142 ('w142'): - Decompose:   - Part 1: Find the row where the result is labeled as "2-candidate-preferred result"     Response 1: SELECT `candidate`, `votes` FROM w WHERE `party` = '2-candidate-preferred result' OR `party_2` = '2-candidate-preferred result' OR `candidate` = '2-candidate-preferred result';  - Retrieval:   SQL: SELECT `candidate`, `votes` FROM w WHERE `party` = '2-candidate-preferred result' OR `party_2` = '2-candidate-preferred result' OR `candidate` = '2-candidate-preferred result';
Executing on table_id 142 ('w142'): SELECT * FROM w WHERE `candidate` IS NOT NULL AND `party` = 'none' AND `party_2` = 'none' AND `candidate` = 'julia ham' OR `candidate` = 'joe mcgirr' OR `candidate` = 'dan hayes' OR `candidate` = 'seb mcdonagh' OR `candidate` = 'ray goodlass' OR `candidate` = 'tom arentz';    However, this is too broad and not precise. Instead, we should identify the row where the header is "2-candidate-preferred result", which indicates a result row.  - Part 2: Find the row where the header is "2-candidate-preferred result"    Response 2: SELECT * FROM w WHERE `party` = 'none' AND `party_2` = 'none' AND `candidate` = 'julia ham' OR `candidate` = 'joe mcgirr' OR `candidate` = 'dan hayes' OR `candidate` = 'seb mcdonagh' OR `candidate` = 'ray goodlass' OR `candidate` = 'tom arentz';    But the actual row is identified by the header "2-candidate-preferred result", which appears in row 13.  - Part 3: Extract the "2-candidate-preferred result" value from that row    Response 3: SELECT `votes` FROM w WHERE `party` = 'none' AND `party_2` = 'none' AND `candidate` = 'julia ham' OR `candidate` = 'joe mcgirr' OR `candidate` = 'dan hayes' OR `candidate` = 'seb mcdonagh' OR `candidate` = 'ray goodlass' OR `candidate` = 'tom arentz' AND `party` = 'none' AND `party_2` = 'none' AND `candidate` = 'julia ham' OR `candidate` = 'joe mcgirr' OR `candidate` = 'dan hayes' OR `candidate` = 'seb mcdonagh' OR `candidate` = 'ray goodlass' OR `candidate` = 'tom arentz';    This is redundant.  Instead, we can observe that the row with "2-candidate-preferred result" as the header (row 13) contains the actual result values. The "2-candidate-preferred result" column is the value of the result for that row. We need to extract the value of the "votes" or "%" for that specific row.  But the question is asking for the "two-candidate-preferred result", which is likely the vote count or percentage for the top two candidates.  Looking at the data: - Row 13: "2-candidate-preferred result" has values: 23001 (joe mcgirr), 15570 (julia ham) - So the two-candidate-preferred result is the vote distribution between the two candidates.  But the statement says: "What's the two-candidate-preferred result of the election..."  So we need to extract the vote values from the row where the header is "2-candidate-preferred result".  - Part 1: Identify the row where the header is "2-candidate-preferred result"   Response 1: SELECT * FROM w WHERE `party` = 'none' AND `party_2` = 'none' AND `candidate` = 'julia ham' OR `candidate` = 'joe mcgirr' OR `candidate` = 'dan hayes' OR `candidate` = 'seb mcdonagh' OR `candidate` = 'ray goodlass' OR `candidate` = 'tom arentz' AND `party` = 'none' AND `party_2` = 'none' AND `candidate` = 'julia ham' OR `candidate` = 'joe mcgirr' OR `candidate` = 'dan hayes' OR `candidate` = 'seb mcdonagh' OR `candidate` = 'ray goodlass' OR `candidate` = 'tom arentz';  But the header "2-candidate-preferred result" appears in row 13, and the values are: - candidate: 'joe mcgirr' → 23001 votes - candidate: 'julia ham' → 15570 votes  So the two-candidate-preferred result is the vote count for these two candidates.  But the question is asking for "the two-candidate-preferred result", which likely means the vote distribution or the total.  But in the table, the "2-candidate-preferred result" row has multiple values: votes and %.  So we can interpret it as: the vote counts or percentages for the two candidates.  But the question is ambiguous.  However, the most direct interpretation is: find the row where the header is "2-candidate-preferred result", and extract the vote values.  So: - Part 1: Find the row where the header is "2-candidate-preferred result"   Response 1: SELECT * FROM w WHERE `party` = 'none' AND `party_2` = 'none' AND `candidate` = 'julia ham' OR `candidate` = 'joe mcgirr' OR `candidate` = 'dan hayes' OR `candidate` = 'seb mcdonagh' OR `candidate` = 'ray goodlass' OR `candidate` = 'tom arentz';
Executing on table_id 142 ('w142'): - Decompose:   - Part 1: Find the rows where the party_2 is labeled as "2-candidate-preferred result"     Response 1: SELECT * FROM w WHERE `party_2` = '2-candidate-preferred result';  - Retrieval:   SQL: SELECT * FROM w WHERE `party_2` = '2-candidate-preferred result';
Executing on table_id 151 ('w151'): - Decompose:    - Part 1: Identify the clubs w played for   - Part 2: Determine the duration (first and last season) for each club   - Part 3: Summarize performance metrics (appearances and goals) across competitions for each club - Retrieval:    SQL: SELECT `club`, MIN(`season`) AS first_season, MAX(`season`) AS last_season, SUM(CAST(REPLACE(`league`, 'apps', '') AS INTEGER)) AS total_apps_league, SUM(CAST(REPLACE(`league_2`, 'apps', '') AS INTEGER)) AS total_apps_league_2, SUM(CAST(REPLACE(`league_3`, 'apps', '') AS INTEGER)) AS total_apps_league_3, SUM(CAST(REPLACE(`fa cup`, 'apps', '') AS INTEGER)) AS total_apps_fa_cup, SUM(CAST(REPLACE(`fa cup_2`, 'apps', '') AS INTEGER)) AS total_apps_fa_cup_2, SUM(CAST(REPLACE(`league cup`, 'apps', '') AS INTEGER)) AS total_apps_league_cup, SUM(CAST(REPLACE(`league cup_2`, 'apps', '') AS INTEGER)) AS total_apps_league_cup_2, SUM(CAST(REPLACE(`other`, 'apps', '') AS INTEGER)) AS total_apps_other, SUM(CAST(REPLACE(`total`, 'apps', '') AS INTEGER)) AS total_apps_total, SUM(CAST(REPLACE(`league`, 'goals', '') AS INTEGER)) AS total_goals_league, SUM(CAST(REPLACE(`league_2`, 'goals', '') AS INTEGER)) AS total_goals_league_2, SUM(CAST(REPLACE(`league_3`, 'goals', '') AS INTEGER)) AS total_goals_league_3, SUM(CAST(REPLACE(`fa cup`, 'goals', '') AS INTEGER)) AS total_goals_fa_cup, SUM(CAST(REPLACE(`fa cup_2`, 'goals', '') AS INTEGER)) AS total_goals_fa_cup_2, SUM(CAST(REPLACE(`league cup`, 'goals', '') AS INTEGER)) AS total_goals_league_cup, SUM(CAST(REPLACE(`league cup_2`, 'goals', '') AS INTEGER)) AS total_goals_league_cup_2, SUM(CAST(REPLACE(`other`, 'goals', '') AS INTEGER)) AS total_goals_other, SUM(CAST(REPLACE(`total`, 'goals', '') AS INTEGER)) AS total_goals_total FROM w GROUP BY `club`;
Executing on table_id 151 ('w151'): - Decompose:   - Part 1: Identify the clubs w played for     Response 1: SELECT DISTINCT `club` FROM w;   - Part 2: For each club, find the duration (span of seasons) he played     Response 2: SELECT `club`, MIN(`season`) AS first_season, MAX(`season`) AS last_season FROM w GROUP BY `club`;   - Part 3: For each club, summarize his performance (goals and appearances) in each league and competition     Response 3: SELECT `club`, `season`, `league`, `league_2`, `league_3`, `fa cup`, `fa cup_2`, `league cup`, `league cup_2`, `other`, `other_2`, `total`, `total_2` FROM w WHERE `club` IS NOT NULL; - Retrieval:   # Using 'OR' to combine the conditions from #1, #2, #3 — however, since the question requires a subtable to help answer the full question, and all performance data is in the original table, we retrieve all rows for full context   SQL: SELECT `club`, `season`, `league`, `league_2`, `league_3`, `fa cup`, `fa cup_2`, `league cup`, `league cup_2`, `other`, `other_2`, `total`, `total_2` FROM w;
Executing on table_id 151 ('w151'): SELECT `club`, MIN(`season`) AS first_season, MAX(`season`) AS last_season, `league`, `league_2`, `league_3`, `fa cup`, `fa cup_2`, `league cup`, `league cup_2`, `other`, `other_2`, `total`, `total_2` FROM w GROUP BY `club`, `season`, `league`, `league_2`, `league_3`, `fa cup`, `fa cup_2`, `league cup`, `league cup_2`, `other`, `other_2`, `total`, `total_2` ORDER BY `club`, `season`;
Executing on table_id 159 ('w159'): SELECT `year`, `film` FROM w WHERE `role` = 'quillo';
Executing on table_id 159 ('w159'): SELECT `year`, `film` FROM w WHERE `role` = 'quillo';
Executing on table_id 159 ('w159'): SELECT `year`, `film` FROM w WHERE `role` = 'quillo';
Executing on table_id 160 ('w160'): - Decompose:    - Part 1: Find all entries where the album is "sail out"   - Part 2: Among those, select the first two by year (ascending order) - Retrieval:    SQL: SELECT `title`, `year` FROM w WHERE `album` = 'sail out' ORDER BY `year` ASC LIMIT 2;
Executing on table_id 160 ('w160'): SELECT `title`, `year` FROM w WHERE `album` = 'sail out' ORDER BY `year` ASC LIMIT 2;
Executing on table_id 160 ('w160'): SELECT `title`, `year` FROM w WHERE `album` = 'sail out' ORDER BY `year` ASC LIMIT 2;
Executing on table_id 162 ('w162'): SELECT * FROM w WHERE `team` LIKE '%smu%';
Executing on table_id 162 ('w162'): - Decompose:   - Part 1: Find the seasons when w coached SMU     Response 1: SELECT season FROM w WHERE team = 'smu';   - Part 2: Find the coaching record (overall) for those seasons     Response 2: SELECT overall FROM w WHERE team = 'smu'; - Retrieval:   SQL: SELECT season, overall FROM w WHERE team = 'smu';
Executing on table_id 162 ('w162'): SELECT * FROM w WHERE `team` = 'smu';
Executing on table_id 166 ('w166'): SELECT `date`, `location` FROM w WHERE `event title` LIKE '%Shooto: Spirit 2010 Summer%';
Executing on table_id 166 ('w166'): SELECT date, location FROM w WHERE `event title` LIKE '%spirit 2010 su%' OR `event title` LIKE '%spirit 2010 summer%';
Executing on table_id 166 ('w166'): - Decompose:   - Part 1: Find the event with a title similar to "Shooto: Spirit 2010 Summer" - Retrieval:   SQL: SELECT `date`, `location` FROM w WHERE `event title` LIKE '%spirit 2010 su%' OR `event title` LIKE '%spirit 2010 summer%';
Executing on table_id 168 ('w168'): Decompose:   - Part 1: Find San Jose State's record in the 2000–01 season     Response 1: SELECT * FROM w WHERE team = 'san jose state' AND season LIKE '2000–1';   - Part 2: Find San Jose State's record in the 2001–02 season     Response 2: SELECT * FROM w WHERE team = 'san jose state' AND season LIKE '2001–2';  Retrieval:   # Use OR to combine the two conditions   SQL: SELECT * FROM w WHERE team = 'san jose state' AND season LIKE '2000–1' OR team = 'san jose state' AND season LIKE '2001–2';
Executing on table_id 168 ('w168'): - Decompose:   - Part 1: Find the rows for San Jose State in the seasons 2000–01 and 2001–02 - Retrieval:   SQL: SELECT * FROM w WHERE team = 'san jose state' AND season IN ('2000–1', '2001–2');
Executing on table_id 168 ('w168'): -Decompose:   - Part 1: Find rows where team is San Jose State and season is 2000–01 (i.e., "2000–1")   - Part 2: Find rows where team is San Jose State and season is 2001–02 (i.e., "2001–2")    -Retrieval:   SQL: SELECT * FROM w WHERE team = 'san jose state' AND (season LIKE '2000–1' OR season LIKE '2001–2');
Executing on table_id 175 ('w175'): SELECT `party`, `seats` FROM w WHERE `seats` = (SELECT MAX(`seats`) FROM w);
Executing on table_id 175 ('w175'): SELECT `party`, `seats` FROM w WHERE `party` NOT IN ('total', 'vacant') AND `seats` = (SELECT MAX(`seats`) FROM w WHERE `party` NOT IN ('total', 'vacant'));
Executing on table_id 175 ('w175'): SELECT `party`, `seats` FROM w WHERE `party` NOT IN ('total', 'vacant') AND `seats` = (SELECT MAX(`seats`) FROM w WHERE `party` NOT IN ('total', 'vacant'));
Executing on table_id 181 ('w181'): SELECT * FROM w WHERE name LIKE '%usain bolt%' OR name LIKE '%bolt%';
Executing on table_id 181 ('w181'): SELECT time, (SELECT time FROM w WHERE name = 'usain bolt') - (SELECT time FROM w WHERE rank > (SELECT rank FROM w WHERE name = 'usain bolt') ORDER BY time ASC LIMIT 1) AS margin FROM w WHERE name = 'usain bolt';
Executing on table_id 181 ('w181'): SELECT * FROM w WHERE name LIKE '%usain bolt%' OR name LIKE '%bolt%';

- col_sql

In [29]:
## step 8: SQP parse column
filtered_tables = {}
filtered_headers = {}
col_sql_index_list = LLM_query_list['Select_Column']['index']
col_sql_response_list = LLM_query_list['Select_Column']['response']
# for ind in tqdm(range(len(wikitq_df_processed))):
for i in range(len(col_sql_index_list)):
    ind = col_sql_index_list[i]
    
    input_df = wikitq_df_processed[ind]
    response_list = col_sql_response_list[i]
    assert isinstance(response_list,list)
    filtered_table, final_headers = filter_dataframe_from_responses(response_list, input_df, add_row_id=True)
    filtered_tables[ind] = filtered_table
    filtered_headers[ind] = final_headers

- SQL-exec

In [30]:
## step 8: SQP parse execute
from tqdm.notebook import tqdm
sample_num = 3
sql_exec_df = {}
valid_parse = 0
warning_list = []
sql_executable_count = []
exec_sql_index_list = LLM_query_list['Execute_SQL']['index']
exec_sql_response_list = LLM_query_list['Execute_SQL']['response']
# for index in tqdm(range(len(wikitq_df_processed))):
for i in range(len(exec_sql_index_list)):
    index = exec_sql_index_list[i]
    sql_exec_df[index] = []
    for sample_ind in range(sample_num):
        
        # original_text = eval(wikitq_df_output.iloc[index,-1])[sample_ind]
        original_text = exec_sql_response_list[i][sample_ind]
        sql = fix_sql_query(response_text=original_text,table_df=wikitq_df_processed[index],table_title=table_titles[index])
        if [index,sample_ind] in warning_list:
            sql = ''
            print(index,sample_ind)
        if sql!='':
            # print(result)
            try:
                result = executor.sql_exec(sql.replace('``','`'), db, table_id=index,add_row_id = True)
                df = pd.DataFrame(result['rows'],columns=result['header'])
            except:
                df = pd.DataFrame()
        else:
            df = pd.DataFrame()
        sql_exec_df[index].append(df)
        if(len(df)>0):
            valid_parse+=1
            sql_pair = {}
            sql_pair['id'] = index
            sql_pair['sample_ind'] = sample_ind
            sql_pair['sql'] = sql
            sql_pair['table'] = df
            sql_executable_count.append(sql_pair)
sql_exec_df_output = merge_clean_and_format_df_dict(sql_exec_df)
    # print(original_text)

Executing on table_id 0 ('w0'): SELECT "single" FROM w WHERE "year" = '1988' AND "album" = 'Across the Rio Grande';
Executing on table_id 0 ('w0'): SELECT "single" FROM w WHERE "year" = '1988' AND "album" = 'Across the Rio Grande';
Executing on table_id 0 ('w0'): SELECT "single" FROM w WHERE "year" = '1988' AND "album" = 'Across the Rio Grande';
Executing on table_id 1 ('w1'): SELECT "fate" FROM w ORDER BY "tonnage (grt)" DESC LIMIT 2;
Executing on table_id 1 ('w1'): SELECT "fate" FROM w ORDER BY "tonnage (grt)" DESC LIMIT 2;
Executing on table_id 1 ('w1'): SELECT "fate" FROM w ORDER BY "tonnage (grt)" DESC LIMIT 2;
Executing on table_id 4 ('w4'): SELECT CASE WHEN COUNT(*) > 0 THEN 'yes' ELSE 'no' END AS answer FROM w WHERE "date" LIKE '2012%' AND ("arena" IS NULL OR "arena" = '');
Executing on table_id 4 ('w4'): SELECT COUNT(*) FROM w WHERE "date" LIKE '2012%' AND "arena" IS NULL OR "arena" = '';
Executing on table_id 4 ('w4'): SELECT COUNT(*) FROM w WHERE SUBSTR("date", 1, 4) = '2012' AND "arena" IS NULL;
Executing on table_id 5 ('w5'): SELECT "role" FROM w WHERE "role" != 'jolene' ORDER BY "year" LIMIT 4;
Executing on table_id 5 ('w5'): SELECT "role" FROM w WHERE "role" != 'jolene' ORDER BY "year" ASC LIMIT 4;
Executing on table_id 5 ('w5'): SELECT "role" FROM w WHERE "role" != 'jolene' ORDER BY "year" ASC LIMIT 4;
Executing on table_id 6 ('w6'): SELECT "time (seconds)", "venue", "date" FROM w WHERE "event" = '55 meters';
Executing on table_id 6 ('w6'): SELECT * FROM w WHERE "event" = '55 meters';
Executing on table_id 6 ('w6'): SELECT * FROM w WHERE "event" = '55 meters';
Executing on table_id 8 ('w8'): SELECT * FROM w WHERE "year" = '2007';
Executing on table_id 8 ('w8'): SELECT "role" FROM w WHERE "year" = '2007';
Executing on table_id 8 ('w8'): SELECT "role" FROM w WHERE "year" = '2007';
Executing on table_id 9 ('w9'): SELECT "role" FROM w WHERE "year" = '2008';
Executing on table_id 9 ('w9'): SELECT * FROM w WHERE "year" = '2008';
Executing on table_id 9 ('w9'): SELECT "role" FROM t WHERE "year" = '2008';
Executing on table_id 10 ('w10'): SELECT "club", "total", "total_2", "total_3" FROM w WHERE "league" = 'total' ORDER BY "total" DESC LIMIT 1;
Executing on table_id 10 ('w10'): SELECT      "club",      "total",      "total_2",      "total_3" FROM w WHERE "league" = 'total' ORDER BY CAST(SUBSTR("total", 1, INSTR("total", ' ') - 1) AS REAL) DESC LIMIT 1;
Executing on table_id 10 ('w10'): SELECT "club", "total", "total_2", "total_3" FROM w WHERE "league" = 'total' ORDER BY "total" DESC LIMIT 1;
Executing on table_id 12 ('w12'): SELECT "category", "`nominated work`" FROM w WHERE "award" = '24th hong kong film awards';
Executing on table_id 12 ('w12'): SELECT "category", "`nominated work`" FROM w WHERE "award" = '24th Hong Kong Film Awards';
Executing on table_id 12 ('w12'): SELECT "category", "`nominated work`" FROM w WHERE "award" = '24th Hong Kong Film Awards';
Executing on table_id 14 ('w14'): SELECT "par" FROM w WHERE "picture dimensions (px × px)" LIKE '%480×%' OR "picture dimensions (px × px)" LIKE '%576×%';
Executing on table_id 14 ('w14'): SELECT "par (decimal)" FROM w WHERE "picture dimensions (px × px)" LIKE '%480%' OR "picture dimensions (px × px)" LIKE '%576%';
Executing on table_id 14 ('w14'): SELECT "par (decimal)", "picture dimensions (px × px)" FROM w WHERE "picture dimensions (px × px)" LIKE '%480×%' OR "picture dimensions (px × px)" LIKE '%576×%';
Executing on table_id 15 ('w15'): SELECT "venue", "notes" FROM w WHERE "year" = '2004' AND "notes" LIKE '%nr%';
Executing on table_id 15 ('w15'): SELECT "venue", "notes" FROM w WHERE "year" = '2004' AND "event" = 'discus throw' AND "notes" LIKE '%nr%';
Executing on table_id 16 ('w16'): Select the second row (i.e., the one after the first) in this ordered list. Since there are only two albums, the second one is "uncontrollable" released in 2010.  This is a simple lookup based on ordering and identifying the second entry — no complex filtering or aggregation is required.  Therefore, no SQL query is needed;
Executing on table_id 16 ('w16'): SELECT "album", "year" FROM w GROUP BY "album" ORDER BY "year" LIMIT 1 OFFSET 1;
Executing on table_id 19 ('w19'): SELECT 11256 - 2008 FROM w WHERE candidate = w (incumbent)' AND party_2 = 'democratic-republican';
Executing on table_id 19 ('w19'): SELECT (SELECT votes FROM w WHERE candidate = w (incumbent)') - (SELECT votes FROM w WHERE candidate = 'christopher harrison') AS majority;
Executing on table_id 19 ('w19'): SELECT 11256 - 2008 FROM w WHERE candidate = w (incumbent)' AND party_2 = 'democratic-republican';
Executing on table_id 21 ('w21'): SELECT "award" FROM w WHERE "year" = 2010 AND "result" = 'won';
Executing on table_id 21 ('w21'): SELECT "award" FROM w WHERE "year" = 2010 AND "result" = 'won';
Executing on table_id 21 ('w21'): SELECT "award" FROM w WHERE "year" = 2010 AND "result" = 'won';
Executing on table_id 22 ('w22'): SELECT COUNT(*) FROM w WHERE "year(s)" > 2013 AND "`bianca's role`" IS NOT NULL AND "`chiara's role`" IS NOT NULL;
Executing on table_id 22 ('w22'): SELECT 1 FROM w WHERE "year(s)" > 2013 AND "`bianca's role`" IS NOT NULL AND "`chiara's role`" IS NOT NULL;
Executing on table_id 23 ('w23'): SELECT name FROM w WHERE rank < 3;
Executing on table_id 23 ('w23'): SELECT name FROM w WHERE rank > 4.0;
Executing on table_id 23 ('w23'): SELECT "name" FROM w WHERE "rank" < 4.0;
Executing on table_id 25 ('w25'): SELECT;
Executing on table_id 25 ('w25'): SELECT "oklahoma", "alabama" FROM w WHERE "statistics" = 'passes, comp-att-int' OR "statistics" = 'passing yards (net)';
Executing on table_id 25 ('w25'): SELECT SUBSTR("alabama", 1, INSTR("alabama", '-') - 1) FROM w WHERE "statistics" = 'passes, comp-att-int';
Executing on table_id 26 ('w26'): Select the value from the "total" column, which represents total appearances.  This is a simple lookup of a specific value in a row with a known condition, and no complex filtering or calculation is needed.  However, note that the "total" column is labeled as "total", and in the context, it likely represents total appearances. Since the question is about appearances for D.C. United in his career, and the row with "season" = "total" and "club" = "d.c. united" has "total" = 184, this is the correct value.  Thus, no complex SQL is required — it's a direct lookup.  Output: None;
Executing on table_id 26 ('w26'): Select the "total" value from that row.  Note: There is a row with "club" = "d.c. united" and "total" = 200, which is the sum of all appearances.  Thus, no complex calculation is needed — it's a direct lookup.  Output: None;
Executing on table_id 28 ('w28'): SELECT * FROM w WHERE year = 2008;
Executing on table_id 28 ('w28'): SELECT * FROM w WHERE "year" = 2008;
Executing on table_id 28 ('w28'): SELECT * FROM w WHERE year = 2008;
Executing on table_id 29 ('w29'): SELECT * FROM w WHERE "director" = 'Lee Jeong-hyang';
Executing on table_id 29 ('w29'): SELECT * FROM w WHERE "director" = 'Lee Jeong-hyang';
Executing on table_id 29 ('w29'): SELECT * FROM w WHERE "director" = 'Lee Jeong-hyang';
Executing on table_id 30 ('w30'): SELECT "title" FROM t WHERE "year" = 1998;
Executing on table_id 30 ('w30'): SELECT * FROM w WHERE "year" = 1998;
Executing on table_id 32 ('w32'): SELECT "award", "category", "year", "film" FROM w ORDER BY "year" ASC LIMIT 1 OFFSET 2;
Executing on table_id 32 ('w32'): SELECT "award", "category", "year", "film" FROM w ORDER BY "year" LIMIT 1 OFFSET 2;
Executing on table_id 32 ('w32'): SELECT "award", "category", "year", "film" FROM w ORDER BY "year" LIMIT 1 OFFSET 2;
Executing on table_id 33 ('w33'): SELECT "party", "party_2", "votes", "%" FROM w WHERE "party" LIKE '%Labour%' OR "party_2" LIKE '%Labour%' OR "party" LIKE '%Conservative%' OR "party_2" LIKE '%Conservative%';
Executing on table_id 33 ('w33'): SELECT "party", "party_2", "candidate", "votes", "%";
Executing on table_id 33 ('w33'): SELECT "party", "party_2", "candidate", "votes", "%" FROM w WHERE "party" LIKE '%Labour%' OR "party" LIKE '%Conservative%' OR "party_2" LIKE '%Labour%' OR "party_2" LIKE '%Conservative%';
Executing on table_id 34 ('w34'): SELECT CAST("seats" AS REAL) / 245 FROM w WHERE "party" = 'supporters of charilaos trikoupis';
Executing on table_id 34 ('w34'): SELECT CAST("seats" AS REAL) / 245 AS ratio FROM w WHERE "party" = 'supporters of charilaos trikoupis';
Executing on table_id 34 ('w34'): SELECT CAST(seats AS REAL) / 245 FROM w WHERE party = 'supporters of charilaos trikoupis';
Executing on table_id 36 ('w36'): SELECT "`club performance`", "league" FROM w WHERE "league" = 'j1 league';
Executing on table_id 36 ('w36'): SELECT "`club performance`", "`club performance_2`" FROM w WHERE "league" = 'j1 league';
Executing on table_id 36 ('w36'): SELECT "`club performance`", "league" FROM w WHERE "league" LIKE '%j1%' OR "league" LIKE '%football%' OR "league_2" LIKE '%j1%' OR "league_2" LIKE '%football%';
Executing on table_id 37 ('w37'): SELECT "destinations" FROM w;
Executing on table_id 37 ('w37'): SELECT "destinations" FROM w;
Executing on table_id 38 ('w38'): SELECT * FROM w WHERE "lane" = 5;
Executing on table_id 38 ('w38'): SELECT "name", "time" FROM w WHERE "lane" = 5;
Executing on table_id 39 ('w39'): SELECT "`voice role`" FROM w WHERE "year" IN (2003, 2005);
Executing on table_id 41 ('w41'): SELECT "year" FROM t WHERE "award" = 'Women in Film Lucy Award';
Executing on table_id 41 ('w41'): SELECT "year" FROM w WHERE "award" = 'Women in Film Lucy Award';
Executing on table_id 42 ('w42'): SELECT "candidate", "votes", "%" FROM w ORDER BY "votes" DESC LIMIT 1;
Executing on table_id 42 ('w42'): SELECT "candidate", "%" FROM w WHERE "candidate" NOT IN ('majority', 'turnout', 'swing') ORDER BY "votes" DESC LIMIT 1;
Executing on table_id 43 ('w43'): SELECT "year" FROM (SELECT "year", COUNT(*) AS role_count FROM w GROUP BY "year" ORDER BY role_count DESC) LIMIT 1;
Executing on table_id 43 ('w43'): SELECT "year" FROM (SELECT "year", COUNT(*) AS role_count FROM w GROUP BY "year" ORDER BY role_count DESC) LIMIT 1;
Executing on table_id 43 ('w43'): SELECT "year" FROM (SELECT "year", COUNT(*) AS role_count FROM w GROUP BY "year" ORDER BY role_count DESC) LIMIT 1;
Executing on table_id 44 ('w44'): SELECT "role" FROM w GROUP BY "role" HAVING COUNT(*) > 1;
Executing on table_id 44 ('w44'): SELECT role FROM w GROUP BY role HAVING COUNT(role) > 1;
Executing on table_id 44 ('w44'): SELECT role FROM w GROUP BY role HAVING COUNT(*) > 1;
Executing on table_id 46 ('w46'): SELECT name FROM w ORDER BY `fastest average` ASC LIMIT 1;
Executing on table_id 46 ('w46'): SELECT "name" FROM w ORDER BY "`fastest average`" ASC LIMIT 1;
Executing on table_id 46 ('w46'): SELECT name FROM w ORDER BY `fastest average` ASC LIMIT 1;
Executing on table_id 47 ('w47'): SELECT "title", "car" FROM w WHERE "position" = '1st';
Executing on table_id 47 ('w47'): SELECT "title", "car" FROM w WHERE "position" = '1st';
Executing on table_id 47 ('w47'): SELECT "title", "car" FROM w WHERE "position" = '1st';
Executing on table_id 48 ('w48'): SELECT "work" FROM w WHERE "result" = 'won';
Executing on table_id 49 ('w49'): SELECT "award description(s)" FROM w WHERE "results" = 'won';
Executing on table_id 49 ('w49'): SELECT "award description(s)" FROM w WHERE "results" = 'won';
Executing on table_id 49 ('w49'): SELECT "award description(s)" FROM w WHERE "results" = 'won';
Executing on table_id 50 ('w50'): SELECT "award", "`nominee / work`" FROM w WHERE "year" = 2015 AND "result" = 'won';
Executing on table_id 50 ('w50'): Select the "award" and "`nominee / work`" columns from the filtered rows.  Since the question does not require counting, summing, or any mathematical operation, and can be answered by a direct lookup of specific values, no complex SQL is needed.  However, note that the question asks for "the award name and nominated movie name" — implying a single result. In the data, there are two entries in 2015 with "won": one for "best actor" and one for "most popular male character". But the question says "the award", suggesting a single award. However, based on the data, two awards were won in 2015. Since the question does not specify which one, and asks for "the award", it may be interpreted as asking for any award won. But given the phrasing, it likely expects the award and movie name where a win occurred.  We will return the first such win (the one with "best actor" and "captain of destiny") as it appears in the data.  But since the question is asking for the award name and nominated movie name (i.e., "`nominee / work`") of the award for which he won in 2015, and there are two wins, we must check if the question implies only one. However, based on the phrasing, it is asking for the award and movie name where a win occurred — so we return the relevant row(s). But since it says "the award", and there are two, we must assume it wants one instance.  Looking at the data: - 2015: "captain of destiny" won in "most popular male character" (result = "won") - 2015: "captain of destiny" also has "best actor" with result = "nominated"  So only one win in 2015: "most popular male character" for "captain of destiny".  Therefore, the correct answer is: - Award: most popular male character - Nominated movie: captain of destiny  This is a simple lookup, so no complex SQL is required.  Output: None;
Executing on table_id 50 ('w50'): SELECT "award", "`nominee / work`" FROM w WHERE "year" = 2015 AND "result" = 'won';
Executing on table_id 51 ('w51'): SELECT;
Executing on table_id 51 ('w51'): SELECT * FROM w WHERE "-" IN ('1987–88', '1985–86');
Executing on table_id 52 ('w52'): SELECT "club", "total" FROM w WHERE "season" = '1935–36';
Executing on table_id 52 ('w52'): SELECT "club", "total" FROM w WHERE "season" = '1935–36';
Executing on table_id 53 ('w53'): SELECT "total" FROM w WHERE "club" = 'botafogo';
Executing on table_id 53 ('w53'): SELECT "total" FROM w WHERE "club" = 'botafogo';
Executing on table_id 54 ('w54'): SELECT "title" FROM w WHERE "director" = 'Steven Spielberg';
Executing on table_id 54 ('w54'): SELECT "title" FROM w WHERE "director" = 'steven spielberg';
Executing on table_id 54 ('w54'): SELECT "title" FROM w WHERE "director" = 'Steven Spielberg';
Executing on table_id 55 ('w55'): SELECT "event", "time (seconds)" FROM Tyler Christopher WHERE "date" = '2008-3-9';
Executing on table_id 55 ('w55'): SELECT "event", "time (seconds)" FROM w WHERE "date" = '2008-3-9';
Executing on table_id 58 ('w58'): SELECT "event" FROM w WHERE "position" = '2nd';
Executing on table_id 58 ('w58'): SELECT "event" FROM w WHERE "position" = '2nd';
Executing on table_id 58 ('w58'): SELECT "event" FROM w WHERE "position" = '2nd';
Executing on table_id 59 ('w59'): SELECT "league", SUM(CAST("goals" AS REAL)) / SUM(CAST("apps" AS REAL)) AS avg_goals_per_app FROM w WHERE "league" IN ('npsl', 'pdl') GROUP BY "league" ORDER BY avg_goals_per_app DESC LIMIT 1;
Executing on table_id 59 ('w59'): SELECT;
Executing on table_id 59 ('w59'): SELECT;
Executing on table_id 60 ('w60'): SELECT "title", "director(s)" FROM w WHERE "year" = '2013';
Executing on table_id 60 ('w60'): Select the "title" and "director(s)" columns for those rows to answer the question.  No complex calculations or aggregations are needed. This is a straightforward filter and selection.  Output: None;
Executing on table_id 60 ('w60'): Select only the "title" and "director(s)" columns to answer the question about which films and who directed them.  Note: The table's name is w, but the actual data is about her roles. The question is asking about her filmography in 2013, so we filter by year and extract relevant fields.  Since no calculation or aggregation is involved, this is a simple lookup.  Output: None;
Executing on table_id 61 ('w61'): SELECT "title", "artist(s)" FROM w WHERE "title" LIKE '%Ned%' AND "year" > 2013;
Executing on table_id 63 ('w63'): SELECT CASE WHEN COUNT(*) > 0 THEN 'yes' ELSE 'no' END AS did_set_record FROM w WHERE name = 'césar cielo' AND record = 'or';
Executing on table_id 63 ('w63'): SELECT COUNT(*) > 0 AS has_record FROM w WHERE "name" = 'césar cielo' AND "record" LIKE '%or%';
Executing on table_id 63 ('w63'): SELECT COUNT(*) FROM w WHERE "name" = 'César Cielo' AND "record" != '';
Executing on table_id 65 ('w65'): Select only the "title" column to list the movies.  Since no counting, summing, or complex filtering beyond a simple range is required, and the question is asking for a list of titles within a range, this is a straightforward lookup.  Output: None;
Executing on table_id 65 ('w65'): SELECT "title" FROM w WHERE "year" BETWEEN 1970 AND 1987;
Executing on table_id 65 ('w65'): SELECT "title" FROM w WHERE "year" BETWEEN 1970 AND 1987;
Executing on table_id 67 ('w67'): SELECT "award", "category" FROM w WHERE "work" = 'kapoor & sons';
Executing on table_id 67 ('w67'): SELECT "award", "category" FROM w WHERE "work" = 'Kapoor & Sons';
Executing on table_id 67 ('w67'): SELECT "award", "category" FROM w WHERE "work" = 'kapoor & sons';
Executing on table_id 68 ('w68'): SELECT "total" FROM w WHERE "season" = '2011';
Executing on table_id 68 ('w68'): SELECT "total" FROM w WHERE "season" = '2011';
Executing on table_id 70 ('w70'): SELECT "title" FROM w WHERE "year" BETWEEN '1992' AND '1994';
Executing on table_id 70 ('w70'): SELECT "title" FROM w WHERE "year" BETWEEN '1992' AND '1994';
Executing on table_id 70 ('w70'): SELECT "title" FROM w WHERE "year" BETWEEN '1992' AND '1994';
Executing on table_id 72 ('w72'): SELECT "candidate", "votes", "%", "±" FROM w WHERE "party" = 'labour' OR "party" = 'socialist labour';
Executing on table_id 72 ('w72'): SELECT "candidate", "votes", "%", "±" FROM w WHERE "party" = 'labour' OR "party" = 'socialist labour';
Executing on table_id 72 ('w72'): Select the candidate, votes, percentage, and ± column values for those rows.  Since the query is about retrieving specific data for two parties, and no counting, summing, or aggregation is required, this is a simple lookup.  Output: None;
Executing on table_id 73 ('w73'): SELECT "notes", "position" FROM w WHERE "year" = '2011' AND "competition" = 'world cross country championships';
Executing on table_id 73 ('w73'): SELECT * FROM w WHERE "year" = '2011' AND "competition" = 'world cross country championships';
Executing on table_id 73 ('w73'): SELECT "notes", "position" FROM w WHERE "year" = '2011' AND "competition" = 'world cross country championships';
Executing on table_id 74 ('w74'): Select the "territory" column from the table to list all places where w was screened.  Since the question does not involve any counting, summing, or complex filtering, and can be answered by a simple lookup, no SQL query is necessary beyond a direct selection.  Output: None;
Executing on table_id 75 ('w75'): SELECT * FROM w WHERE "title" = '7 Deadly Sins';
Executing on table_id 75 ('w75'): SELECT * FROM w WHERE "title" = '7 Deadly Sins';
Executing on table_id 76 ('w76'): SELECT "name" FROM w WHERE "`date from`" = '1949-1';
Executing on table_id 76 ('w76'): SELECT "name" FROM w WHERE "`date from`" = '1949-1';
Executing on table_id 76 ('w76'): SELECT "name" FROM w WHERE "`date from`" = '1949-1';
Executing on table_id 77 ('w77'): SELECT "title" FROM w WHERE year = 2012;
Executing on table_id 77 ('w77'): SELECT query.  Output: None;
Executing on table_id 77 ('w77'): SELECT "title" FROM w WHERE year = 2012;
Executing on table_id 80 ('w80'): Select the "candidate" and "votes" columns to show how many votes each candidate obtained.   Step 3: Since no mathematical operation or complex filtering is required, this is a simple lookup.  No complex filtering or aggregation is needed — the data is already in a format where each row represents a candidate and their vote count.  Output: None;
Executing on table_id 80 ('w80'): SELECT "candidate", "votes" FROM w;

/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')

In [31]:
## step 8: SQP parse aggregate
processed_table = {} ## processed_table包括了inference LLM后所有结果的聚合,key 与 method_key 保持一致
processed_table['Base'] = wikitq_df_processed
processed_table['Select_Row'] = filtered_tables_row
processed_table['Select_Column'] = filtered_tables
processed_table['RAG_20_5'] = RAG_20_5
processed_table['Execute_SQL'] = sql_exec_df_output ## SQL聚合结果！
processed_table['Execute_SQL_count'] = sql_executable_count ## SQL单个结果，用作 CrossEncoder 跨模态查询

In [32]:
## step 8: SQP parse aggregate
np.save(f'{tmp_save_path}/processed_table.npy',processed_table)

- Run Check Model

In [33]:
## Step 9: generated check model data 
# 对每一条数据，维护一个 Sequence_Operator
# 每条数据应该对应一个 Dict,这个Dict 包含了3 个参数：
    # id: index
    # Sequence: Operator Sequence
    # Terminated: True/False
    # Check Score: CrossEncoder 分数
    # Check Status: True/False,当前是否被计算
# 对每条数据，如果 Terminated = True，则不参与计算
# 对应的，如果 Terminated = False，那么查看 Check Status,如果 Statue=False，那么计算 Check_Score
# 每一轮计算之后，Check_Score 更新，Check Statue更新，该轮开始判定，用一个 threshold
# 如果 Check Status = True, Check Score >= Threshold，那么标注 Terminated = True，当前路径被接收
# 如果 Check Status = True, Check Score < Threshold，那么Terminated = False, Check Status = False, Check Score 清空
# Check Score 触发 RollBack 机制，即除了‘Execute_SQL'外，Extract 回退，重新计算当前流程
# 如果当前操作符只有'Execute_SQL’和空（所有 RollBack 均未被接收），那么触发 FORWARD,Terminated  = True，强制修改 Operator Sequence 为['Execute_SQL']
Check_Model_Data_Sequence = {}
for key in ranked_result.keys(): ## 遍历所有数据,初始化
    start_sequence = ranked_result[key]
    Check_Model_Data_Sequence[key] = {}
    Check_Model_Data_Sequence[key]['id'] = key
    Check_Model_Data_Sequence[key]['Sequence'] = start_sequence
    if start_sequence == ['Base'] or start_sequence == ['Execute_SQL']: ## Terminated 不参与计算
        Check_Model_Data_Sequence[key]['Terminated'] = True
        Check_Model_Data_Sequence[key]['Check_Status'] = False
        Check_Model_Data_Sequence[key]['Check_Score'] = 0.0
    else:
        Check_Model_Data_Sequence[key]['Terminated'] = False
        Check_Model_Data_Sequence[key]['Check_Status'] = False
        Check_Model_Data_Sequence[key]['Check_Score'] = 0.0
# Check_Model_Data_Sequence[4]
for key in Check_Model_Data_Sequence.keys():
    data_entry = Prepare_Data_for_Operator_Sequence(key,Check_Model_Data_Sequence[key]['Sequence'],dataset, processed_table)
    Check_Model_Data_Sequence[key]['data_entry'] = data_entry
## Check

- load ReRanking Model

In [34]:
## step 9 load rerank model
reranker_model = FlagReranker(check_moedl_path, use_fp16=True)

In [35]:
## step 9: iterative check
check_tau = check_tau
for loop in range(3):
    updated_data = batch_rerank_scores(reranker_model, Check_Model_Data_Sequence, batch_size=16)
    Check_Model_Data_Sequence = updated_data
    ## Check Terminal Status
    for key in Check_Model_Data_Sequence.keys():
        if Check_Model_Data_Sequence[key]['Terminated'] == True:
            continue
        else:
            if Check_Model_Data_Sequence[key]['Check_Status'] == True:
                if Check_Model_Data_Sequence[key]['Check_Score'] >= check_tau: ## 0.5 threshold
                    Check_Model_Data_Sequence[key]['Terminated'] = True
                else:
                    Check_Model_Data_Sequence[key]['Terminated'] = False
                    Check_Model_Data_Sequence[key]['Check_Status'] = False
                    Check_Model_Data_Sequence[key]['Check_Score'] = 0.0
                    current_sequence = Check_Model_Data_Sequence[key]['Sequence']
                    ROLLBACK_seq, terminated_flag = ROLLBACK(current_sequence)
                    Check_Model_Data_Sequence[key]['Sequence'] = ROLLBACK_seq
                    Check_Model_Data_Sequence[key]['Terminated'] = terminated_flag
                    if terminated_flag == False:
                        data_entry = Prepare_Data_for_Operator_Sequence(key,ROLLBACK_seq,dataset, processed_table)
                        Check_Model_Data_Sequence[key]['data_entry'] = data_entry
            else:
                raise ValueError("Check Status should be True when Terminated is False after reranking.")

Filtering items to rerank (Terminated=False and data_entry exists)...
Computing scores for 289 items with batch size 16...

huggingface/tokenizers: The current process just got forked, after parallelism has already been used. Disabling parallelism to avoid deadlocks...
To disable this warning, you can either:
	- Avoid using `tokenizers` before the fork if possible
	- Explicitly set the environment variable TOKENIZERS_PARALLELISM=(true | false)
initial target device:   0%|          | 0/2 [00:00<?, ?it/s]huggingface/tokenizers: The current process just got forked, after parallelism has already been used. Disabling parallelism to avoid deadlocks...
To disable this warning, you can either:
	- Avoid using `tokenizers` before the fork if possible
	- Explicitly set the environment variable TOKENIZERS_PARALLELISM=(true | false)
initial target device:  50%|█████     | 1/2 [00:03<00:03,  3.56s/it]huggingface/tokenizers: The current process just got forked, after parallelism has already been used. Disabling parallelism to avoid deadlocks...
To disable this warning, you can either:
	- Avoid using `tokenizers` before the fork if possible
	- Explicitly set the environment variable TOKENIZERS_PARALLELISM=(true | false)
initial target device: 100%|██████████| 2/2 [00:07<00:00,  3.56s/it]
pre tokenize:   0%|          | 0/10 [00:00<?, ?it/s]You're using a XLMRobertaTokenizerFast tokenizer. Please note that with a fast tokenizer, using the `__call__` method is faster than using a method to encode the text followed by a call to the `pad` method to get a padded encoding.
pre tokenize: 100%|██████████| 10/10 [00:00<00:00, 177.86it/s]
Compute Scores: 100%|██████████| 10/10 [00:00<00:00, 45.78it/s]
pre tokenize:   0%|          | 0/9 [00:00<?, ?it/s]t]You're using a XLMRobertaTokenizerFast tokenizer. Please note that with a fast tokenizer, using the `__call__` method is faster than using a method to encode the text followed by a call to the `pad` method to get a padded encoding.
pre tokenize: 100%|██████████| 9/9 [00:00<00:00, 261.60it/s]
Compute Scores: 100%|██████████| 9/9 [00:00<00:00, 44.57it/s]
Chunks: 100%|██████████| 2/2 [00:02<00:00,  1.17s/it]

Updating scores in the original dictionary...
Reranking complete.
Filtering items to rerank (Terminated=False and data_entry exists)...
Computing scores for 60 items with batch size 16...

pre tokenize: 100%|██████████| 2/2 [00:00<00:00, 155.77it/s]
pre tokenize: 100%|██████████| 2/2 [00:00<00:00, 125.98it/s]
Compute Scores: 100%|██████████| 2/2 [00:00<00:00, 21.49it/s]
Compute Scores: 100%|██████████| 2/2 [00:00<00:00, 21.59it/s]
Chunks: 100%|██████████| 2/2 [00:00<00:00, 16.07it/s]

Updating scores in the original dictionary...
Reranking complete.
Filtering items to rerank (Terminated=False and data_entry exists)...
No items to process.

### Check Additional Execute SQL and Execute

In [36]:
## step 10: add missing SQL
SQL_list_final = []
for index in range(len(dataset)):
    sequence = Check_Model_Data_Sequence[index]['Sequence']
    if sequence==[] or sequence.__contains__('Execute_SQL'):
        SQL_list_final.append(index)
add_sql_list = list(set(SQL_list_final) - set(LLM_query_list['Execute_SQL']['index']))
add_sql_query_list = []
for index in add_sql_list:
    prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/sql_reason_wtq.txt',processed=True)
    add_sql_query_list.extend([prompt])
add_sql_response_list = response_vllm(llm,add_sql_query_list, sample_num=3)

Formatting Prompts:   0%|          | 0/4 [00:00<?, ?it/s]

Adding requests:   0%|          | 0/4 [00:00<?, ?it/s]

Processed prompts:   0%|          | 0/12 [00:00<?, ?it/s, est. speed input: 0.00 toks/s, output: 0.00 toks/s]

Processing Outputs:   0%|          | 0/4 [00:00<?, ?it/s]

In [79]:
## step 10: add missing SQL
SQL_list_final = []
for index in range(len(dataset)):
    sequence = Check_Model_Data_Sequence[index]['Sequence']
    if sequence==[] or sequence.__contains__('Execute_SQL'):
        SQL_list_final.append(index)
add_sql_list = set([i for i in range(len(dataset))]) - set(LLM_query_list['Execute_SQL']['index'])
add_sql_query_list = []
for index in add_sql_list:
    prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/sql_reason_fetaqa.txt',processed=True)
    add_sql_query_list.extend([prompt])
add_sql_response_list = response_vllm(llm,add_sql_query_list, sample_num=3)

Formatting Prompts:   0%|          | 0/163 [00:00<?, ?it/s]

Adding requests:   0%|          | 0/163 [00:00<?, ?it/s]

Processed prompts:   0%|          | 0/489 [00:00<?, ?it/s, est. speed input: 0.00 toks/s, output: 0.00 toks/s]

Processing Outputs:   0%|          | 0/163 [00:00<?, ?it/s]

In [82]:
### step 10: add sql parse and execute
from tqdm.notebook import tqdm
sample_num = 3
sql_exec_df = {}
valid_parse = 0
warning_list = []
sql_executable_count = []
# exec_sql_index_list = LLM_query_list['Execute_SQL']['index']
# exec_sql_response_list = LLM_query_list['Execute_SQL']['response']
# for index in tqdm(range(len(wikitq_df_processed))):
add_sql_list = list(add_sql_list)
for i in range(len(add_sql_list)):
    index = add_sql_list[i]
    sql_exec_df[index] = []
    for sample_ind in range(sample_num):
        
        # original_text = eval(wikitq_df_output.iloc[index,-1])[sample_ind]
        original_text = add_sql_response_list[i][sample_ind]
        sql = fix_sql_query(response_text=original_text,table_df=wikitq_df_processed[index],table_title=table_titles[index])
        if [index,sample_ind] in warning_list:
            sql = ''
            print(index,sample_ind)
        if sql!='':
            # print(result)
            try:
                result = executor.sql_exec(sql.replace('``','`'), db, table_id=index,add_row_id = True)
                df = pd.DataFrame(result['rows'],columns=result['header'])
            except:
                df = pd.DataFrame()
        else:
            df = pd.DataFrame()
        sql_exec_df[index].append(df)
        if(len(df)>0):
            valid_parse+=1
            sql_pair = {}
            sql_pair['id'] = index
            sql_pair['sample_ind'] = sample_ind
            sql_pair['sql'] = sql
            sql_pair['table'] = df
            sql_executable_count.append(sql_pair)
sql_exec_df_output_new = merge_clean_and_format_df_dict(sql_exec_df)
    # print(original_text)
for index in sql_exec_df_output_new.keys():
    sql_exec_df_output[index] = sql_exec_df_output_new[index]
processed_table['Execute_SQL'] = sql_exec_df_output

Executing on table_id 3 ('w3'): SELECT COUNT(*) FROM t WHERE "album" = 'holly dunn';
Executing on table_id 515 ('w515'): SELECT "date", "country" FROM w WHERE "format" = 'digital download';
Executing on table_id 515 ('w515'): SELECT "date", "country" FROM w WHERE "format" = 'digital download';
Executing on table_id 515 ('w515'): SELECT "date", "country" FROM w WHERE "format" = 'digital download';
Executing on table_id 1541 ('w1541'): Select the "date" and "label" from that row.    Since this is a direct lookup and does not require counting, summing, or complex filtering, no SQL query is needed beyond a simple selection.  However, note that the table name is w and the column names are correctly referenced. The query will retrieve the required date and label.  Output: None;
Executing on table_id 1541 ('w1541'): Select the "date" and "label" from that row.  Since this is a direct lookup and does not involve counting, summing, or complex filtering, no SQL query is needed beyond a simple selection.  However, note that the table is named w and the column names are already defined. The question is asking for the date and label in the United States, which can be directly retrieved.  Output: None;
Executing on table_id 1541 ('w1541'): SELECT * FROM w WHERE "country" = 'united states';
Executing on table_id 1549 ('w1549'): SELECT;
Executing on table_id 1549 ('w1549'): SELECT      (CAST(SUBSTR(t1.time, 1, 1) AS INTEGER) * 60 +       CAST(SUBSTR(t1.time, 3, 2) AS REAL) +       CAST(SUBSTR(t1.time, 6, 2) AS REAL) / 100) AS thorpe_time,     (CAST(SUBSTR(t2.time, 1, 1) AS INTEGER) * 60 +       CAST(SUBSTR(t2.time, 3, 2) AS REAL) +       CAST(SUBSTR(t2.time, 6, 2) AS REAL) / 100) AS hackett_time,     (CAST(SUBSTR(t2.time, 1, 1) AS INTEGER) * 60 +       CAST(SUBSTR(t2.time, 3, 2) AS REAL) +       CAST(SUBSTR(t2.time, 6, 2) AS REAL) / 100) -      (CAST(SUBSTR(t1.time, 1, 1) AS INTEGER) * 60 +       CAST(SUBSTR(t1.time, 3, 2) AS REAL) +       CAST(SUBSTR(t1.time, 6, 2) AS REAL) / 100) AS time_difference FROM      (SELECT time FROM w WHERE name = 'ian thorpe') t1,     (SELECT time FROM w WHERE name = 'grant hackett') t2;
Executing on table_id 1549 ('w1549'): SELECT;
Executing on table_id 536 ('w536'): SELECT position FROM Surprise WHERE chart = 'the billboard 200' UNION SELECT position FROM Surprise WHERE chart = 'top r&b/hip-hop albums';
Executing on table_id 536 ('w536'): SELECT position FROM Surprise WHERE chart = 'the billboard 200' OR chart = 'Top R&B/Hip-Hop Albums';
Executing on table_id 536 ('w536'): SELECT position FROM Surprise WHERE chart = 'the Billboard 200' OR chart = 'US Top R&B/Hip-Hop Albums';
Executing on table_id 537 ('w537'): SELECT "year" FROM w WHERE "award" = 'Hollywood Music in Media Awards' AND "result" = 'nominated';
Executing on table_id 537 ('w537'): SELECT "year" FROM w WHERE "award" = 'Hollywood Music in Media Awards';
Executing on table_id 537 ('w537'): SELECT "year" FROM w WHERE "award" = 'Hollywood Music in Media Awards';
Executing on table_id 546 ('w546'): SELECT COUNT(*) FROM (SELECT "location" FROM w GROUP BY "location" HAVING COUNT(*) > 1);
Executing on table_id 546 ('w546'): SELECT location FROM w GROUP BY location HAVING COUNT(*) > 1;
Executing on table_id 546 ('w546'): SELECT location, COUNT(*) AS museum_count FROM w GROUP BY location HAVING COUNT(*) > 1;
Executing on table_id 1065 ('w1065'): SELECT "event", "time (seconds)", "venue", "date" FROM w WHERE "event" IN ('100 meters', '400 meters') ORDER BY "time (seconds)" ASC LIMIT 2;
Executing on table_id 1065 ('w1065'): SELECT event, MIN("time (seconds)") AS best_time, date;
Executing on table_id 1065 ('w1065'): SELECT "event", "time (seconds)", "date" FROM w WHERE "event" IN ('100 meters', '400 meters') ORDER BY "time (seconds)" ASC LIMIT 2;
Executing on table_id 1069 ('w1069'): SELECT "final" FROM w WHERE "rank" IN ('2', '3');
Executing on table_id 560 ('w560'): SELECT CAST(seats AS REAL) / 169 AS ratio FROM w WHERE "seats" = (SELECT MAX(seats) FROM w WHERE seats != 'none' AND seats IS NOT NULL) AND seats IS NOT NULL;
Executing on table_id 560 ('w560'): SELECT CAST(seats AS REAL) / 169 AS ratio FROM w WHERE party != 'total' AND party != 'source: nohlen & stöver' ORDER BY seats DESC LIMIT 1;
Executing on table_id 560 ('w560'): SELECT CAST(MAX("seats") AS REAL) / 169 AS ratio FROM w WHERE "party" != 'total' AND "seats" IS NOT NULL;
Executing on table_id 1591 ('w1591'): SELECT ABS((SELECT seats FROM w WHERE party = 'social democratic party') - (SELECT seats FROM w WHERE party = 'centre party'));
Executing on table_id 1591 ('w1591'): SELECT ABS((SELECT seats FROM w WHERE party = 'social democratic party') - (SELECT seats FROM w WHERE party = 'centre party'));
Executing on table_id 1591 ('w1591'): SELECT ABS((SELECT seats FROM w WHERE party = 'social democratic party') - (SELECT seats FROM w WHERE party = 'centre party'));
Executing on table_id 56 ('w56'): SELECT "line" FROM w WHERE "station" = 'Leopoldplatz';
Executing on table_id 56 ('w56'): SELECT DISTINCT "line" FROM w WHERE "station" = 'Leopoldplatz';
Executing on table_id 56 ('w56'): SELECT "line" FROM w WHERE "station" = 'Leopoldplatz';
Executing on table_id 1080 ('w1080'): Select the "distance", "stage", and "date" (though date is not total) — but only distance and stage count are meaningful.  But the stage count is not in the "stage" column. The stage column has values like "1", "2", ..., "23", and the "none" row is the total. So we can use that row.  Final decision: The total distance and total number of stages can be extracted. Time is not available. Since the question includes "time", and time is not present, the query cannot fully answer the question.  But if we interpret "total duration" as only distance and stages (and time is missing), then we can still extract distance and stages.  However, the question says "in distance, time, and stages", so unless time is present, we cannot answer.  But the table does not have a time column. So time cannot be retrieved.  Therefore, the question cannot be fully answered with the given data.  But the task is to determine if an SQLite program is needed. Since the question requires extracting total values (distance and stages), and such values exist in the table, we can write a query to extract them.  We will assume the user meant to ask for total distance and total stages, and time is not available.  Step 1: Filter the table to find all rows where the "album" is 'holly dunn'. Step 2: Count the number of rows where "album" is 'holly dunn' and the album is 'holly dunn' Final Output: The question requires counting the number of singles from the album 'holly dunn'. This involves filtering and counting, which is a mathematical operation.  Step 1: Identify the relevant columns and rows in the table. Identify if the question requires any mathematical operations (e.g., counting, summing, finding the maximum/minimum, averaging) or complex filtering that goes beyond a simple lookup.  The question requires counting the number of singles released from a specific album. This involves filtering based on a text pattern and then counting, which is a mathematical operation.  Step 1: Filter the table to find all rows where the "notes" column contains 'uncredited'.  Step 2: Count the number of matching films from the filtered results. Final Output: Output: None  Wait, the question is about "how many films" — not "how many films". The question is not a simple lookup, so we need to write an SQLite program.   Response: Output: None  Final Output: A step-by-step reasoning followed by the following SQLite program as the solution, or 'None' if SQL is not required.  Final Output: Output: The question requires counting the number of films where the "notes" column contains 'uncredited' and the role is "iris' father" from the table. This involves filtering based on a text pattern and counting, which is a mathematical operation.  Step 1: Identify the table structure and the specific question to determine if any complex filtering or mathematical operations are required.  The table has a column named "year", which contains a list of years. The values in the table are: 1984, 1984, 1978, 1978, 1985, 1986, 1985, 1985, 1984, 1986    "iris" 1985    20 1984    "iris" 1978 1985    "my heart holds on" 60 1984    "my heart holds on" 60 10 1985    "my heart holds on" 64  —   holly dunn 1986    "daddy's hands" 33  —   holly dunn 1986    "my heart holds on" 33  —   holly dunn 1984    "after hours" 1985    "after hours club" 1984    "after hours club berlin patron" 1985    the muppets take manhattan 1984    the muppets take manhattan  extra   uncredited 1984    the muppets take manhattan  "iris' father"  uncredited 1984    after hours club berlin patron  uncredited 1984    after hours club berlin patron    uncredited 1984    the muppets take manhattan  "iris' father"  uncredited, (newspaper article) 1984    the muppets take manhattan  extra   uncredited 1984    after hours club berlin patron  uncredited </input> </input> <output> Output:  Output: None </input> </input> </input> <output> Final Output: The question requires counting the number of films released by the title 'holly dunn' in the table. The question can be answered by a simple lookup, so no SQL is required. </output> </input> </output> </input> </input> <output> Final Output: The question asks for the number of singles from the album 'holly dunn'. This requires filtering and counting, which is a mathematical operation.  Step 1: Filter the table to find all rows where the "album" is 'holly dunn' and count the number of rows where the "album" is 'holly dunn' and the "album" is 'holly dunn' and the "role" is 'uncredited' in the "notes" column.  Step 2: Count the number of rows where the "album" is 'holly dunn'. The question requires a simple lookup. The table contains pre-calculated total rows, so we can use them to find the total number of singles released from the album 'holly dunn'.  Step 1: Filter the table to find all rows where the "notes" column contains 'uncredited'.  Step 2: Count the number of rows where the "notes" column contains 'uncredited' and the role is uncredited. Step 2: Count the number of films where the "notes" column contains 'uncredited' and the role is 'iris' father' in the table. Step 1: Filter the table to find all rows where the "notes" column contains 'uncredited'. Step 1: Filter the table to find all rows where;
Executing on table_id 1080 ('w1080'): SELECT "distance" AS total_distance, COUNT(*) AS total_stages FROM w WHERE "stage" != 'none' GROUP BY "stage";
Executing on table_id 1080 ('w1080'): SELECT * FROM w WHERE "notes" LIKE '%uncredited%' and "role" = 'iris' and the notes are uncredited.  Step 2: Count the number of films where the role is 'iris' and the role is 'iris' and the notes are uncredited. Final Output: Step 1: Filter the table to find all rows where the "notes" contains the word 'uncredited' and then count the rows. Step 2: Count the number of films with uncredited roles by checking if the "notes" column has the word 'uncredited' in the table. The question is asking how many singles were released from the album 'holly dunn'? The question asks for the number of singles from the album 'holly dunn'. This requires filtering the table and performing a count, which is a mathematical operation.  Step 1: The question requires counting the number of films where the role is "iris' father" in the table t. The table has no "total" row, and the question is about a specific value. We are to determine whether you need an SQLite program to solve the question based on the provided table. You must first understand the question and the table. Identify if the question requires any mathematical operations (e.g., counting, summing, finding the maximum/minimum, averaging) or complex filtering that goes beyond a simple lookup.  The final output must be either a simple lookup or a simple query that directly answers the question. Final Output: Output: None </output>;
Executing on table_id 1596 ('w1596'): SELECT "result" FROM w WHERE "date" = '1929-2-2' AND "opponent" = 'ireland' AND "competition" = '1929 british home championship';
Executing on table_id 1087 ('w1087'): SELECT "years" FROM w WHERE "venue" = 'Rancho Park Golf Course';
Executing on table_id 1087 ('w1087'): SELECT "years" FROM w WHERE "venue" = 'Rancho Park Golf Course';
Executing on table_id 581 ('w581'): SELECT "event", "`prize money`" FROM w ORDER BY "year" ASC LIMIT 1;
Executing on table_id 581 ('w581'): SELECT "event", "`prize money`" FROM w ORDER BY "year" ASC LIMIT 1;
Executing on table_id 581 ('w581'): SELECT "event", "`prize money`" FROM w ORDER BY "year" ASC LIMIT 1;
Executing on table_id 1605 ('w1605'): SELECT "tournament", "prize (us$)" FROM w WHERE "year" IN (1980, 1993);
Executing on table_id 1605 ('w1605'): SELECT "tournament", "prize (us$)" FROM w WHERE "year" IN (1993, 1980);
Executing on table_id 1605 ('w1605'): SELECT "tournament", "prize (us$)" FROM w WHERE "year" IN (1993, 1980);
Executing on table_id 71 ('w71'): Select the "result" column to determine the performance (e.g., nominated or won).  This does not require any mathematical operations or complex aggregations — it's a straightforward filtering and retrieval of specific values.  Therefore, no complex SQL is needed.  Output: None;
Executing on table_id 71 ('w71'): SELECT "result" FROM w WHERE "year" IN (2010, 2011);
Executing on table_id 1608 ('w1608'): SELECT * FROM w WHERE "district" = 'kupwara';
Executing on table_id 1608 ('w1608'): SELECT * FROM w WHERE "district" = 'kupwara';
Executing on table_id 587 ('w587'): SELECT;
Executing on table_id 587 ('w587'): SELECT MIN("date") AS start_date, MAX("date") AS end_date FROM w WHERE "date" LIKE '2017-%';
Executing on table_id 587 ('w587'): SELECT MIN("city") AS kickoff_city, MAX("city") AS conclusion_city FROM w WHERE "date" LIKE '2017-%' ORDER BY "date";
Executing on table_id 1100 ('w1100'): SELECT "name", "time" FROM w WHERE "name" IN ('david davies', 'yuri prilukov');
Executing on table_id 589 ('w589'): Select the required fields: opponent, date, and result (to show performance).  Note: The table has a row where "score" is "none" and "result" is "4–1", suggesting that "result" may represent the final outcome. We extract the opponent, date, and result as requested.  Since the query involves filtering by a specific competition and selecting specific fields, it is a straightforward filtering and selection task, not requiring complex aggregation or mathematical operations.  However, the question asks for "how did Chhangte perform", which is captured by the "result" column. Thus, we are simply retrieving data based on a condition.  This is a simple lookup with a filter, not requiring any counting, summing, or complex logic.  Output: None;
Executing on table_id 589 ('w589'): SELECT "opponent", "date", "result" FROM w WHERE "competition" = '2015 saff championship';
Executing on table_id 589 ('w589'): SELECT "opponent", "date", "result" FROM w WHERE "competition" = '2015 saff championship';
Executing on table_id 78 ('w78'): SELECT * FROM w ORDER BY date LIMIT 2;
Executing on table_id 78 ('w78'): SELECT MIN("date") AS start_date, MAX("date") AS end_date FROM w;
Executing on table_id 78 ('w78'): SELECT MIN("date") AS start_date, MAX("date") AS end_date FROM w;
Executing on table_id 592 ('w592'): Select the "city" and "country" columns from that row.  Since the query involves only a simple filter and lookup, no complex operations are needed.  Output: None;
Executing on table_id 596 ('w596'): SELECT "competition", "notes" FROM w WHERE "position" = '5th';
Executing on table_id 596 ('w596'): SELECT * FROM w WHERE "position" = '5th';
Executing on table_id 596 ('w596'): SELECT "competition", "notes" FROM w WHERE "position" = '5th';
Executing on table_id 1109 ('w1109'): Select only the "date" column from those rows.  No complex calculations or counting are required. The answer can be directly retrieved via a simple filter and selection.  Output: None;
Executing on table_id 1109 ('w1109'): SELECT "date" FROM w WHERE "stadium/track" = 'Sunderland Greyhound Stadium' OR "stadium/track" = 'Yarmouth Stadium';
Executing on table_id 601 ('w601'): SELECT "name", "time" FROM w WHERE "rank" IN (4.0, 5.0);
Executing on table_id 601 ('w601'): SELECT "name", "time" FROM w WHERE "rank" IN (4, 5);
Executing on table_id 601 ('w601'): SELECT "name", "time" FROM w WHERE "rank" IN (4, 5);
Executing on table_id 604 ('w604'): SELECT "city", "country" FROM w WHERE "date" BETWEEN '2011-09-11' AND '2011-09-12';
Executing on table_id 604 ('w604'): SELECT "city", "country" FROM w WHERE "date" BETWEEN '2011-09-11' AND '2011-09-12';
Executing on table_id 604 ('w604'): SELECT "city", "country" FROM w WHERE "date" BETWEEN '2011-9-11' AND '2011-9-12';
Executing on table_id 1118 ('w1118'): SELECT "`nominee / work`" FROM w WHERE "award" = 'Favorite Artist Philippines' AND "result" = 'won' AND "year" IN (2002, 2003);
Executing on table_id 1118 ('w1118'): SELECT "`nominee / work`" FROM w WHERE "award" = 'Favorite Artist Philippines' AND "result" = 'won' AND "year" IN (2002, 2003);
Executing on table_id 1118 ('w1118'): SELECT "`nominee / work`" FROM w WHERE "award" = 'Favorite Artist Philippines' AND "result" = 'won' AND "year" IN (2002, 2003);
Executing on table_id 608 ('w608'): SELECT "position", "notes" FROM w WHERE "year" = '2011' AND "competition" = 'su universiade' AND "venue" = 'shenzhen, china';
Executing on table_id 1639 ('w1639'): SELECT * FROM w WHERE "year" = 1981 AND "competition" = 'world cup';
Executing on table_id 1639 ('w1639'): SELECT * FROM w WHERE "year" = 1981 AND "competition" = 'world cup';
Executing on table_id 1639 ('w1639'): SELECT "event" FROM w WHERE "year" = 1981 AND "competition" = 'world cup';
Executing on table_id 104 ('w104'): SELECT "position", "venue" FROM w WHERE "year" = '2015' AND "competition" = 'world championships' AND "event" = '10000 m';
Executing on table_id 104 ('w104'): Select the "position" and "venue" from the filtered row.  No complex calculation or aggregation is needed. This is a straightforward query based on exact matches.  Output: None;
Executing on table_id 622 ('w622'): SELECT COUNT(*) FROM w WHERE name = 'dark dragon''s den' OR name = 'Manitoba magical Workshop';
Executing on table_id 622 ('w622'): SELECT COUNT(*) FROM w WHERE "name" = 'Manitoba magical Workshop' OR "name" = 'dark dragon den';
Executing on table_id 622 ('w622'): SELECT COUNT(*) FROM w WHERE name = 'majisto''s magical workshop' OR name = 'dark dragon''s den';
Executing on table_id 113 ('w113'): select the "distance (yards)" values.  No complex filtering or computation is needed. This is a straightforward extraction.  Output: None;
Executing on table_id 113 ('w113'): select the "distance (yards)" column to list all the race distances.  No complex operations or calculations are required. This is a straightforward retrieval of data.  Output: None;
Executing on table_id 1653 ('w1653'): SELECT (SELECT "sisters" FROM w WHERE "-" = '1930') - (SELECT "sisters" FROM w WHERE "-" = '1840') AS growth;
Executing on table_id 1653 ('w1653'): SELECT (SELECT "sisters" FROM w WHERE "-" = '1930') - (SELECT "sisters" FROM w WHERE "-" = '1840');
Executing on table_id 1653 ('w1653'): SELECT (SELECT "sisters" FROM w WHERE "-" = '1930') - (SELECT "sisters" FROM w WHERE "-" = '1840') AS growth;
Executing on table_id 118 ('w118'): Select only the "work" column from the first row (LIMIT 1).  This is a simple lookup based on chronological order and does not require counting, summing, or complex filtering.  Output: None;
Executing on table_id 118 ('w118'): SELECT "work" FROM w WHERE "result" = 'won' ORDER BY "year" ASC LIMIT 1;
Executing on table_id 1661 ('w1661'): SELECT;
Executing on table_id 1661 ('w1661'): SELECT;
Executing on table_id 1661 ('w1661'): SELECT MIN("date") AS first_release_date, "label" FROM w WHERE "format" = 'digital download' GROUP BY "label";

/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')
/data/workspace/yanmy/HybridRAG/H-STAR/utils/schedule_utils.py:276: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  final_df = unique_df.fillna('')

In [83]:
np.save(f'{tmp_save_path}/Check_Model_Data_Sequence.npy',Check_Model_Data_Sequence)

In [84]:
## step 8: SQP parse aggregate
np.save(f'{tmp_save_path}/processed_table_forward.npy',processed_table)

In [85]:
Check_Model_Data_Sequence = np.load(f'{tmp_save_path}/Check_Model_Data_Sequence.npy',allow_pickle=True).item()

In [41]:
## step 11: generate QA result
prompt_list = []
for index in range(len(dataset)):
    sequence = Check_Model_Data_Sequence[index]['Sequence']
    prompt = build_wikitq_prompt_from_df(dataset,Check_Model_Data_Sequence[index]['data_entry']['table'],index,template_path='../prompts/text_reason_fetaqa.txt',processed=True)
    if sequence==[] or sequence.__contains__('Execute_SQL'):
        # try:
        evidence = table_to_str_sql(processed_table['Execute_SQL'][index])
        prompt = prompt + evidence
    prompt_list.append(prompt)
# wikitq_df['instruction'] = prompt_list

In [89]:
## step 11: generate QA result
prompt_list = []
for index in range(len(dataset)):
    sequence = Check_Model_Data_Sequence[index]['Sequence']
    # prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/text_reason_fetaqa.txt',processed=True)
    prompt = build_wikitq_prompt_from_df(dataset,wikitq_df_processed[index],index,template_path='../prompts/text_reason_fetaqa.txt',processed=True)
    # if sequence==[] or sequence.__contains__('Execute_SQL'):
        # try:
    evidence = table_to_str_sql(processed_table['Execute_SQL'][index])
    prompt = prompt + evidence
    prompt_list.append(prompt)
# wikitq_df['instruction'] = prompt_list

In [90]:
## step 11: execute QA
qa_final = response_vllm(llm,prompt_list, sample_num=1)
wikitq_df = pd.DataFrame(dataset)
wikitq_df['instruction'] = prompt_list
wikitq_df['predict'] = qa_final

Formatting Prompts:   0%|          | 0/2003 [00:00<?, ?it/s]

Adding requests:   0%|          | 0/2003 [00:00<?, ?it/s]

Processed prompts:   0%|          | 0/2003 [00:00<?, ?it/s, est. speed input: 0.00 toks/s, output: 0.00 toks/s…

Processing Outputs:   0%|          | 0/2003 [00:00<?, ?it/s]

In [91]:
import numpy as np
from nltk.translate.bleu_score import sentence_bleu, SmoothingFunction
from rouge_score import rouge_scorer

In [98]:


def calculate_metrics(predictions, ground_truths):
    """
    计算给定预测和真实标签的 BLEU 和 ROUGE 分数。

    参数:
    predictions (list of str): 模型生成的句子列表。
    ground_truths (list of str): 对应的标准参考句子列表。

    返回:
    dict: 包含平均分数的字典，键为 'bleu', 'rouge1', 'rouge2', 'rougeL'。
    """
    if len(predictions) != len(ground_truths):
        raise ValueError("预测列表和真实标签列表的长度必须相同。")

    # --- 初始化 ROUGE 评估器 ---
    # use_stemmer=True 表示在计算时使用词干提取
    scorer = rouge_scorer.RougeScorer(['rouge1', 'rouge2', 'rougeL'], use_stemmer=True)
    
    # --- 初始化用于存储每个样本分数的列表 ---
    bleu_scores = []
    rouge1_f_scores = []
    rouge2_f_scores = []
    rougeL_f_scores = []
    
    # --- NLTK 的 BLEU 平滑函数，避免因 n-gram 不匹配而导致分数为0 ---
    smoothie = SmoothingFunction().method1

    # --- 遍历每一对预测和真实标签 ---
    for pred, truth in tqdm(zip(predictions, ground_truths)):
        
        # --- 计算 ROUGE 分数 ---
        # scorer.score 返回一个包含 precision, recall, f-measure 的字典
        try:
            rouge_scores = scorer.score(truth, pred)
        except:
            # print(truth,pred)
            
            print(truth)
            print(f'fail to parse {pred}\ntruth: {truth}\n')
            pred = 'unknown answer'
            truth = 'unknown answer'
        # 我们通常关心 F1-score (fmeasure)
        rouge1_f_scores.append(rouge_scores['rouge1'].fmeasure)
        rouge2_f_scores.append(rouge_scores['rouge2'].fmeasure)
        rougeL_f_scores.append(rouge_scores['rougeL'].fmeasure)
        
        # --- 计算 BLEU 分数 ---
        # NLTK 的 sentence_bleu 需要将句子分词
        # 参考答案(truth)需要是一个列表的列表，因为一个预测可能对应多个参考答案
        truth_tokens = truth.split()
        pred_tokens = pred.split()
        
        bleu_score = sentence_bleu(
            truth_tokens, 
            pred_tokens, 
            smoothing_function=smoothie
        )
        bleu_scores.append(bleu_score)

    # --- 计算所有样本的平均分数 ---
    avg_bleu = np.mean(bleu_scores)
    avg_rouge1 = np.mean(rouge1_f_scores)
    avg_rouge2 = np.mean(rouge2_f_scores)
    avg_rougeL = np.mean(rougeL_f_scores)

    return {
        'bleu': avg_bleu,
        'rouge1': avg_rouge1,
        'rouge2': avg_rouge2,
        'rougeL': avg_rougeL
    }

# metrics = calculate_metrics([extract_answer_direct(q[0]) for q in qa_final], wikitq_df['answer'].tolist())
metrics = calculate_metrics([extract_answer_direct(q[0]) for q in qa_final], wikitq_df['answer'].tolist())
metrics

0it [00:00, ?it/s]

{'bleu': np.float64(0.0025289414062992124),
 'rouge1': np.float64(0.5651646873933305),
 'rouge2': np.float64(0.35309686469671303),
 'rougeL': np.float64(0.46546035445178374)}

In [97]:
extract_answer_direct(qa_final[55][0]).replace("  \n```",'')

'On March 9, 2008, Tyler Christopher achieved a new record (NR) in the 400 meters (indoor) event with a time of 45.67 seconds in Valencia, Spain.'

In [76]:
calculate_metrics([extract_answer_direct(qa_final[i][0]) for i in [7]], [dataset[i]['answer'] for i in [7]])

0it [00:00, ?it/s]

{'bleu': np.float64(0.0),
 'rouge1': np.float64(0.5128205128205129),
 'rouge2': np.float64(0.27027027027027023),
 'rougeL': np.float64(0.41025641025641024)}

In [77]:
def extract_answer(qa_final, index):
    qa_final_result = qa_final[index][0]
    split_1 = qa_final_result.split('Final Answer:')
    split_2 = split_1[-1].split('Output:')
    # print(len(split_1),len(split_2))
    if len(split_2)>1:
        answer = split_2[-1].strip()
    elif len(split_1)>1:
        answer = split_1[-1].strip()
    else:
        answer = qa_final_result.strip()
    return answer
def extract_answer_direct(input):
    qa_final_result = input
    split_1 = qa_final_result.split('Final Answer:')
    split_2 = split_1[-1].split('Output:')
    # print(len(split_1),len(split_2))
    if len(split_2)>1:
        answer = split_2[-1].strip()
    elif len(split_1)>1:
        answer = split_1[-1].strip()
    else:
        answer = input.strip()
    return answer
print(extract_answer_direct(qa_final[7][0]))
wikitq_df['answer'].tolist()[7]

Robert Boulter played two roles in 2008: Jimmy Dearden in "waking the dead" and Neil in "survivors".

'In 2008, Boulter starred as the character "Jimmy Dearden" in the two-part episode "Wounds" of the television series Waking the Dead.'

AttributeError: 'list' object has no attribute 'split'

In [45]:
metrics

{'bleu': np.float64(0.0008851297477959677),
 'rouge1': np.float64(0.2089121834369353),
 'rouge2': np.float64(0.1194370606974515),
 'rougeL': np.float64(0.17580847708541528)}